doc/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-02-11 Fri 10:51 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Postmodern</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Sabra Crolleton">
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<header>
<h1 class="title">Postmodern</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#6887e7c3-c818-469a-b5f1-10a4b578b90b">Dependencies</a></li>
<li><a href="#554e0dee-93b3-47b1-b808-3bd6c366b784">License</a></li>
<li><a href="#6f05b344-12c2-42b0-b231-3aaced30afb8">Download and installation</a></li>
<li><a href="#b5bb7222-8134-4dcb-83b7-f764b7f2bb33">Quickstart</a>
<ul>
<li><a href="#eccad49e-8df8-4451-89ff-4987b103c9dd">Table Creation</a>
<ul>
<li><a href="#7629810d-8ccb-4236-b540-6aff596a042f">With SQL or S-SQL</a></li>
<li><a href="#5129ed89-2ff3-45b4-ae70-41c2c286eacc">With a Previously Created DAO</a></li>
</ul>
</li>
<li><a href="#0b22f6d2-20e4-49cd-a311-083aade58cbf">Inserting Data</a></li>
</ul>
</li>
<li><a href="#b15533d8-efa3-43a9-b632-a3256cea261f">Authentication</a></li>
<li><a href="#8993c7bd-4ba2-4080-8c5a-ff90de45eca5">Reference</a></li>
<li><a href="#e2475974-6131-40ef-9ca3-54bf111a5dd0">Data Types</a>
<ul>
<li><a href="#b850ea6c-b61e-4601-8423-65a8a626cb58">Data Types</a></li>
</ul>
</li>
<li><a href="#passing-binary-parameters">Passing Parameters as Text or Binary</a></li>
<li><a href="#fc095960-ba9d-4a98-ac89-0db7a56777f1">Caveats and to-dos</a>
<ul>
<li><a href="#e5c68251-0ca6-4f96-8d36-175cec626eeb">Timezones and Simple-Date and Local-Time</a>
<ul>
<li><a href="#orga2d6dea">Simple-Date Library Use</a></li>
<li><a href="#org58574b4">Local-Time Library Use</a></li>
</ul>
</li>
<li><a href="#bdf9ddb0-5f95-4807-8862-8970b35bd142">Portability</a></li>
<li><a href="#565fad0b-aef4-497c-92d8-096a0a78c804">Reserved Words</a></li>
<li><a href="#4ac8f5f4-d3b0-41c5-a222-fe3086049279">Things that should be implemented</a></li>
</ul>
</li>
<li><a href="#773ee4ef-a685-484e-bc6a-6daa849a7d04">Resources</a></li>
<li><a href="#844add79-070b-4e89-8797-3bc21ea3173b">Running tests</a></li>
</ul>
</div>
</nav>
<p>
Version 1.33.4
</p>

<p>
Postmodern is a Common Lisp library for interacting with <a href="https://postgresql.org">PostgreSQL databases</a>.
Features are:
</p>

<ul class="org-ul">
<li>Efficient communication with the database server without need for foreign libraries.</li>
<li>Support for UTF-8 on Unicode-aware Lisp implementations</li>
<li>A syntax for mixing SQL and Lisp code</li>
<li>Convenient support for prepared statements and stored procedures</li>
<li>A metaclass for simple database-access objects</li>
</ul>

<p>
The biggest differences between this library and <a href="http://quickdocs.org/clsql/">clsql</a> or <a href="https://github.com/fukamachi/cl-dbi">cl-dbi</a>
are that Postmodern has no intention of being portable across different SQL
implementations (it embraces non-standard PostgreSQL features), and approaches
extensions like lispy SQL and database access objects in a quite different way.
This library was written because the CLSQL approach did not really work for
me. Your mileage may vary.
</p>

<div id="outline-container-6887e7c3-c818-469a-b5f1-10a4b578b90b" class="outline-2">
<h2 id="6887e7c3-c818-469a-b5f1-10a4b578b90b">Dependencies</h2>
<div class="outline-text-2" id="text-6887e7c3-c818-469a-b5f1-10a4b578b90b">
<p>
The library depends on <a href="http://quickdocs.org/usocket/">usocket</a> (except on <a href="http://sbcl.org/">SBCL</a> and <a href="https://franz.com/products/allegrocl/">ACL</a>, where the built-in socket library is used), <a href="https://github.com/pmai/md5.git">md5</a>, <a href="https://github.com/pcostanza/closer-mop.git">closer-mop</a>, <a href="https://github.com/sionescu/bordeaux-threads.git">bordeaux-threads</a> if you want
thread-safe connection pools, and <a href="https://github.com/cl-plus-ssl/cl-plus-ssl.git">CL+SSL</a> when SSL connections are needed.
</p>

<p>
As of version 1.3 it also depends on <a href="https://github.com/sharplispers/ironclad">ironclad</a>, <a href="https://github.com/massung/base64">base64</a> and <a href="https://github.com/sabracrolleton/uax-15">uax-15</a> because of the need to support scram-sha-256 authentication.
</p>

<p>
Postmodern itself is split into four different packages, some of which can be used independently:
</p>

<ul class="org-ul">
<li><a href="simple-date.html">Simple-date</a> is a very basic implementation of date and time objects, used to support storing and retrieving time-related</li>
</ul>
<p>
SQL types. It is not loaded by default and you can use <a href="https://github.com/dlowe-net/local-time">local-time</a> instead.
</p>

<ul class="org-ul">
<li><a href="cl-postgres.html">CL-postgres</a> is the low-level library used for interfacing with a PostgreSQL server over a socket.</li>

<li><a href="s-sql.html">S-SQL</a> is used to compile s-expressions to strings of SQL code, escaping any Lisp values inside, and doing as much as</li>
</ul>
<p>
possible of the work at compile time. Finally,
</p>

<ul class="org-ul">
<li><a href="postmodern.html">Postmodern</a> itself is a wrapper around these packages and provides higher level functions, a very simple data access object that can be mapped directly to database tables and some convient utilities. It then tries to put all these things together into a convenient programming interface.itself is the library that tries to put all these things together into a convenient programming interface.</li>
</ul>
</div>
</div>

<div id="outline-container-554e0dee-93b3-47b1-b808-3bd6c366b784" class="outline-2">
<h2 id="554e0dee-93b3-47b1-b808-3bd6c366b784">License</h2>
<div class="outline-text-2" id="text-554e0dee-93b3-47b1-b808-3bd6c366b784">
<p>
Postmodern is released under a zlib-style license. Which approximately
means you can use the code in whatever way you like, except for passing
it off as your own or releasing a modified version without indication
that it is not the original.
</p>

<p>
The functions execute-file.lisp were ported from <a href="https://github.com/dimitri/pgloader">pgloader</a> with grateful thanks to
Dimitri Fontaine and are released under a BSD-3 license.
</p>
</div>
</div>

<div id="outline-container-6f05b344-12c2-42b0-b231-3aaced30afb8" class="outline-2">
<h2 id="6f05b344-12c2-42b0-b231-3aaced30afb8">Download and installation</h2>
<div class="outline-text-2" id="text-6f05b344-12c2-42b0-b231-3aaced30afb8">
<p>
We suggest using <a href="https://quicklisp.org">quicklisp.org</a> for installation.
</p>

<p>
A git repository with the most recent changes can be viewed or checked out at:
</p>

<p>
&gt; git clone <a href="https://github.com/marijnh/Postmodern">https://github.com/marijnh/Postmodern</a>
</p>
</div>
</div>
