doc/index.org
* Quickstart
  :PROPERTIES:
  :ID:       f55510fb-3715-4cdd-9e37-4ab0e968e72d
  :CUSTOM_ID: b5bb7222-8134-4dcb-83b7-f764b7f2bb33
  :END:
This quickstart is intended to give you a feel of the way coding with
Postmodern works. Further details about the workings of the library
can be found in the reference manuals linked below.

Assuming you have already installed quicklisp, load postmodern.
#+BEGIN_SRC lisp
(ql:quickload :postmodern)
(use-package :postmodern)
#+END_SRC

If you have a PostgreSQL server running on localhost, with a database called 'testdb'
on it, which is accessible for user 'foucault' with password 'surveiller', there are
two basic ways to connect to a database. If your role/application/database(s) looks
like a 1:1 relationship and you are not using threads, you can connect like this:
#+BEGIN_SRC lisp
(connect-toplevel "testdb" "foucault" "surveiller" "localhost")
#+END_SRC

This will establish a connection to be used by all code, except for that wrapped
in a with-connection form, which takes the same arguments but only establishes
the connection within that lexical scope.

Connect-toplevel will maintain a single connection for the life of the session.

If the server is not on localhost, replace that string with a string containing the ip address of the server:
#+BEGIN_SRC lisp
(connect-toplevel "testdb" "foucault" "surveiller" "216.27.61.135")
#+END_SRC

If the Postgresql server is running on a port other than 5432,
you would also pass the appropriate keyword port parameter. E.g.:

#+BEGIN_SRC lisp
(connect-toplevel "testdb" "foucault" "surveiller" "localhost" :port 5434)
#+END_SRC

Ssl connections would similarly use the keyword parameter :use-ssl and
pass :no, :try, :require, :yes, or :full

- :try means if the server supports it
- :require means use provided ssl certificate with no verification
- :yes means verify that the server cert is issued by a trusted CA, but does not verify the server hostname
- :full means expect a CA-signed cert for the supplied hostname and verify the server hostname

If you have multiple roles connecting to one or more databases, i.e. 1:many or
many:1, (in other words, changing connections) or you are using threads (each thread must have its own connection) then with Postmodern you can use the =with-connection= form which establishes a connection with a lexical scope is more appropriate.
#+BEGIN_SRC lisp
(with-connection '("testdb" "foucault" "surveiller" "localhost")
  ...)
#+END_SRC
For other connection options, please see [[https://marijnhaverbeke.nl/postmodern.html#function-connection][https://marijnhaverbeke.nl/postmodern.html#function-connection]]

If you are creating a database, you need to have established a connection
to a currently existing database (typically "postgres"). Assuming the foucault role
is a superuser and you want to stay in a development connection with your new database
afterwards, you would first use with-connection to connect to postgres, create the
database and then switch to connect-toplevel for development ease.
#+BEGIN_SRC lisp
(with-connection '("postgres" "foucault" "surveiller" "localhost")
  (create-database 'testdb :limit-public-access t
                     :comment "This database is for testing silly theories"))

(connect-toplevel "testdb" "foucault" "surveiller" "localhost")
#+END_SRC
Note: (create-database) functionality is new to postmodern v. 1.32. Setting the
:limit-public-access parameter to t will block connections to that database from
anyone who you have not explicitly given permission (except other superusers).

A word about Postgresql connections. Postgresql connections are not lightweight
threads. They actually consume about 10 MB of memory per connection. In addition, any connections
which require security (ssl or scram authentication) will take additiona time and create
more overhead.

Postgresql can be tuned to limit the number of connections allowed at any one time. It defaults to 100. The parameter is set in the postgresql.conf file. Depending on the size of your server and what you are doing, the sweet spot generally seems to be between 200-400 connections before you need to bring in connection pooling.

If your application is threaded, each thread should use its own connection. Connections are stateful and attempts to use the same connection for multiple threads will

If you have an application like a web app which will make many connections, you also
generally do not want to create and drop connections for every query. The usual solution
is to use connection pools so that the application is grabbing an already existing connection
and returning it to the pool when finished, saving connection time and memory.

To use postmodern's simple connection pooler, the =with-connection= call would look like:
#+BEGIN_SRC lisp
(with-connection '("testdb" "foucault" "surveiller" "localhost" :pooled-p t)
      ...)
#+END_SRC

The maximum number of connections in the pool is set in the special variable
*max-pool-size*, which defaults to nil (no maximum).

Now for a basic sanity test which does not need a database connection at all:

#+BEGIN_SRC lisp
(query "select 22, 'Folie et déraison', 4.5")
;; => ((22 "Folie et déraison" 9/2))
#+END_SRC
That should work. query is the basic way to send queries to the database.
The same query can be expressed like this:
#+BEGIN_SRC lisp
(query (:select 22 "Folie et déraison" 4.5))
;; => ((22 "Folie et déraison" 9/2))
#+END_SRC

In many contexts, query strings and lists starting with keywords can be used
interchangeably. The lists will be compiled to SQL. The S-SQL manual describes
the syntax used by these expressions. Lisp values occurring in them are
automatically escaped. In the above query, only constant values are used, but
it is possible to transparently use run-time values as well:
#+BEGIN_SRC lisp
(defun database-powered-addition (a b)
  (query (:select (:+ a b)) :single))

(database-powered-addition 1030 204)
;; => 1234
#+END_SRC

That last argument, :single, indicates that we want the result not as a list
of lists (for the result rows), but as a single value, since we know that we
are only selecting one value. Some other options are :rows, :row, :column, :alists,
:plists, :array-hash, :json-strs, :json-str, :json-array-str, :dao and :none.
Their precise effect is documented in the [[file:postmodern.html][Postmodern reference manual]] under [[file:postmodern.html#querying][Queries]]

You do not have to pull in the whole result of a query at once, you can
also iterate over it with the doquery macro:
#+BEGIN_SRC lisp
(doquery (:select 'x 'y :from 'some-imaginary-table) (x y)
  (format t "On this row, x = ~A and y = ~A.~%" x y))
#+END_SRC

You can work directly with the database or you can use a simple
database-access-class (aka dao) which would cover all the fields in a row.
This is what a database-access class looks like:
#+BEGIN_SRC lisp
(defclass country ()
  ((name :col-type string :initarg :name
         :reader country-name)
   (inhabitants :col-type integer :initarg :inhabitants
                :accessor country-inhabitants)
   (sovereign :col-type (or db-null string) :initarg :sovereign
              :accessor country-sovereign))
  (:metaclass dao-class)
  (:keys name))
#+END_SRC
The above defines a class that can be used to handle records in a table named
'country' with three columns: name, inhabitants, and sovereign. The :keys
parameter specifies which column(s) are used for the primary key. Once you have
created the class, you can return an instance of the country class by calling

#+BEGIN_SRC lisp
(get-dao 'country "Croatia")
#+END_SRC

You can also define classes that use multiple columns in the primary key:

#+BEGIN_SRC lisp
(defclass points ()
  ((x :col-type integer :initarg :x
      :reader point-x)
   (y :col-type integer :initarg :y
      :reader point-y)
   (value :col-type integer :initarg :value
          :accessor value))
  (:metaclass dao-class)
  (:keys x y))
#+END_SRC

In this case, retrieving a points record would look like the following where
12 and 34 would be the values you are looking to find in the x column and y
column respectively.:

#+BEGIN_SRC lisp
(get-dao 'points 12 34)
#+END_SRC

Consider a slightly more complicated version of country:
#+BEGIN_SRC lisp
(defclass country-c ()
  ((id :col-type integer :col-identity t :accessor id)
   (name :col-type string :col-unique t :check (:<> 'name "")
         :initarg :name :reader country-name)
   (inhabitants :col-type integer :initarg :inhabitants
                :accessor country-inhabitants)
   (sovereign :col-type (or db-null string) :initarg :sovereign
              :accessor country-sovereign)
   (region-id :col-type integer :col-references ((regions id))
              :initarg :region-id :accessor region-id))
  (:metaclass dao-class)
  (:table-name countries))
#+END_SRC

In this example we have an id column which is specified to be an identity column.
Postgresql will automatically generate a sequence of of integers and this will
be the primary key.

We have a name column which is specified as unique and is not null and the
check will ensure that the database refuses to accept an empty string as the name.

We have a region-id column which references the id column in the regions table.
This is a foreign key constraint and Postgresql will not accept inserting a country
into the database unless there is an existing region with an id that matches this
number. Postgresql will also not allow deleting a region if there are countries
that reference that region's id. If we wanted Postgresql to delete countries when
regions are deleted, that column would be specified as:
#+BEGIN_SRC lisp
(region-id :col-type integer :col-references ((regions id) :cascade)
  :initarg :region-id :accessor region-id)
#+END_SRC

Now you can see why the double parens.

We also specify that the table name is not "country" but "countries". (Some style guides
recommend that table names be plural and references to rows be singular.)

