doc/index.html

<div id="outline-container-b5bb7222-8134-4dcb-83b7-f764b7f2bb33" class="outline-2">
<h2 id="b5bb7222-8134-4dcb-83b7-f764b7f2bb33">Quickstart</h2>
<div class="outline-text-2" id="text-b5bb7222-8134-4dcb-83b7-f764b7f2bb33">
<p>
This quickstart is intended to give you a feel of the way coding with
Postmodern works. Further details about the workings of the library
can be found in the reference manuals linked below.
</p>

<p>
Assuming you have already installed quicklisp, load postmodern.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(ql:quickload <span style="color: #23d7d7;">:postmodern</span>)
(use-package <span style="color: #23d7d7;">:postmodern</span>)
</pre>
</div>

<p>
If you have a PostgreSQL server running on localhost, with a database called 'testdb'
on it, which is accessible for user 'foucault' with password 'surveiller', there are
two basic ways to connect to a database. If your role/application/database(s) looks
like a 1:1 relationship and you are not using threads, you can connect like this:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(connect-toplevel <span style="color: #e67128;">"testdb"</span> <span style="color: #e67128;">"foucault"</span> <span style="color: #e67128;">"surveiller"</span> <span style="color: #e67128;">"localhost"</span>)
</pre>
</div>

<p>
This will establish a connection to be used by all code, except for that wrapped
in a with-connection form, which takes the same arguments but only establishes
the connection within that lexical scope.
</p>

<p>
Connect-toplevel will maintain a single connection for the life of the session.
</p>

<p>
If the server is not on localhost, replace that string with a string containing the ip address of the server:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(connect-toplevel <span style="color: #e67128;">"testdb"</span> <span style="color: #e67128;">"foucault"</span> <span style="color: #e67128;">"surveiller"</span> <span style="color: #e67128;">"216.27.61.135"</span>)
</pre>
</div>

<p>
If the Postgresql server is running on a port other than 5432,
you would also pass the appropriate keyword port parameter. E.g.:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(connect-toplevel <span style="color: #e67128;">"testdb"</span> <span style="color: #e67128;">"foucault"</span> <span style="color: #e67128;">"surveiller"</span> <span style="color: #e67128;">"localhost"</span> <span style="color: #23d7d7;">:port</span> 5434)
</pre>
</div>

<p>
Ssl connections would similarly use the keyword parameter :use-ssl and
pass :no, :try, :require, :yes, or :full
</p>

<ul class="org-ul">
<li>:try means if the server supports it</li>
<li>:require means use provided ssl certificate with no verification</li>
<li>:yes means verify that the server cert is issued by a trusted CA, but does not verify the server hostname</li>
<li>:full means expect a CA-signed cert for the supplied hostname and verify the server hostname</li>
</ul>

<p>
If you have multiple roles connecting to one or more databases, i.e. 1:many or
many:1, (in other words, changing connections) or you are using threads (each thread must have its own connection) then with Postmodern you can use the <code>with-connection</code> form which establishes a connection with a lexical scope is more appropriate.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">with-connection</span> '(<span style="color: #e67128;">"testdb"</span> <span style="color: #e67128;">"foucault"</span> <span style="color: #e67128;">"surveiller"</span> <span style="color: #e67128;">"localhost"</span>)
  ...)
</pre>
</div>
<p>
For other connection options, please see <a href="https://marijnhaverbeke.nl/postmodern.html#function-connection">https://marijnhaverbeke.nl/postmodern.html#function-connection</a>
</p>

<p>
If you are creating a database, you need to have established a connection
to a currently existing database (typically "postgres"). Assuming the foucault role
is a superuser and you want to stay in a development connection with your new database
afterwards, you would first use with-connection to connect to postgres, create the
database and then switch to connect-toplevel for development ease.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">with-connection</span> '(<span style="color: #e67128;">"postgres"</span> <span style="color: #e67128;">"foucault"</span> <span style="color: #e67128;">"surveiller"</span> <span style="color: #e67128;">"localhost"</span>)
  (create-database 'testdb <span style="color: #23d7d7;">:limit-public-access</span> t
                     <span style="color: #23d7d7;">:comment</span> <span style="color: #e67128;">"This database is for testing silly theories"</span>))

(connect-toplevel <span style="color: #e67128;">"testdb"</span> <span style="color: #e67128;">"foucault"</span> <span style="color: #e67128;">"surveiller"</span> <span style="color: #e67128;">"localhost"</span>)
</pre>
</div>
<p>
Note: (create-database) functionality is new to postmodern v. 1.32. Setting the
:limit-public-access parameter to t will block connections to that database from
anyone who you have not explicitly given permission (except other superusers).
</p>

<p>
A word about Postgresql connections. Postgresql connections are not lightweight
threads. They actually consume about 10 MB of memory per connection. In addition, any connections
which require security (ssl or scram authentication) will take additiona time and create
more overhead.
</p>

<p>
Postgresql can be tuned to limit the number of connections allowed at any one time. It defaults to 100. The parameter is set in the postgresql.conf file. Depending on the size of your server and what you are doing, the sweet spot generally seems to be between 200-400 connections before you need to bring in connection pooling.
</p>

<p>
If your application is threaded, each thread should use its own connection. Connections are stateful and attempts to use the same connection for multiple threads will
</p>

<p>
If you have an application like a web app which will make many connections, you also
generally do not want to create and drop connections for every query. The usual solution
is to use connection pools so that the application is grabbing an already existing connection
and returning it to the pool when finished, saving connection time and memory.
</p>

<p>
To use postmodern's simple connection pooler, the <code>with-connection</code> call would look like:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">with-connection</span> '(<span style="color: #e67128;">"testdb"</span> <span style="color: #e67128;">"foucault"</span> <span style="color: #e67128;">"surveiller"</span> <span style="color: #e67128;">"localhost"</span> <span style="color: #23d7d7;">:pooled-p</span> t)
      ...)
</pre>
</div>

<p>
The maximum number of connections in the pool is set in the special variable
<b>max-pool-size</b>, which defaults to nil (no maximum).
</p>

<p>
Now for a basic sanity test which does not need a database connection at all:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query <span style="color: #e67128;">"select 22, 'Folie et d&#233;raison', 4.5"</span>)
<span style="color: #74af68;">;; </span><span style="color: #74af68;">=&gt; ((22 "Folie et d&#233;raison" 9/2))</span>
</pre>
</div>
<p>
That should work. query is the basic way to send queries to the database.
The same query can be expressed like this:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> 22 <span style="color: #e67128;">"Folie et d&#233;raison"</span> 4.5))
<span style="color: #74af68;">;; </span><span style="color: #74af68;">=&gt; ((22 "Folie et d&#233;raison" 9/2))</span>
</pre>
</div>

<p>
In many contexts, query strings and lists starting with keywords can be used
interchangeably. The lists will be compiled to SQL. The S-SQL manual describes
the syntax used by these expressions. Lisp values occurring in them are
automatically escaped. In the above query, only constant values are used, but
it is possible to transparently use run-time values as well:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">defun</span> <span style="color: #00ede1; font-weight: bold;">database-powered-addition</span> (a b)
  (query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:+</span> a b)) <span style="color: #23d7d7;">:single</span>))

(database-powered-addition 1030 204)
<span style="color: #74af68;">;; </span><span style="color: #74af68;">=&gt; 1234</span>
</pre>
</div>

<p>
That last argument, :single, indicates that we want the result not as a list
of lists (for the result rows), but as a single value, since we know that we
are only selecting one value. Some other options are :rows, :row, :column, :alists,
:plists, :array-hash, :json-strs, :json-str, :json-array-str, :dao and :none.
Their precise effect is documented in the <a href="postmodern.html">Postmodern reference manual</a> under <a href="postmodern.html#querying">Queries</a>
</p>

<p>
You do not have to pull in the whole result of a query at once, you can
also iterate over it with the doquery macro:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(doquery (<span style="color: #23d7d7;">:select</span> 'x 'y <span style="color: #23d7d7;">:from</span> 'some-imaginary-table) (x y)
  (format t <span style="color: #e67128;">"On this row, x = ~A and y = ~A.~%"</span> x y))
</pre>
</div>

<p>
You can work directly with the database or you can use a simple
database-access-class (aka dao) which would cover all the fields in a row.
This is what a database-access class looks like:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">defclass</span> <span style="color: #34cae2;">country</span> ()
  ((name <span style="color: #23d7d7;">:col-type</span> string <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:name</span>
         <span style="color: #23d7d7;">:reader</span> country-name)
   (inhabitants <span style="color: #23d7d7;">:col-type</span> integer <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:inhabitants</span>
                <span style="color: #23d7d7;">:accessor</span> country-inhabitants)
   (sovereign <span style="color: #23d7d7;">:col-type</span> (or db-null string) <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:sovereign</span>
              <span style="color: #23d7d7;">:accessor</span> country-sovereign))
  (<span style="color: #23d7d7;">:metaclass</span> dao-class)
  (<span style="color: #23d7d7;">:keys</span> name))
</pre>
</div>
<p>
The above defines a class that can be used to handle records in a table named
'country' with three columns: name, inhabitants, and sovereign. The :keys
parameter specifies which column(s) are used for the primary key. Once you have
created the class, you can return an instance of the country class by calling
</p>

<div class="org-src-container">
<pre class="src src-lisp">(get-dao 'country <span style="color: #e67128;">"Croatia"</span>)
</pre>
</div>

<p>
You can also define classes that use multiple columns in the primary key:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">defclass</span> <span style="color: #34cae2;">points</span> ()
  ((x <span style="color: #23d7d7;">:col-type</span> integer <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:x</span>
      <span style="color: #23d7d7;">:reader</span> point-x)
   (y <span style="color: #23d7d7;">:col-type</span> integer <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:y</span>
      <span style="color: #23d7d7;">:reader</span> point-y)
   (value <span style="color: #23d7d7;">:col-type</span> integer <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:value</span>
          <span style="color: #23d7d7;">:accessor</span> value))
  (<span style="color: #23d7d7;">:metaclass</span> dao-class)
  (<span style="color: #23d7d7;">:keys</span> x y))
</pre>
</div>

<p>
In this case, retrieving a points record would look like the following where
12 and 34 would be the values you are looking to find in the x column and y
column respectively.:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(get-dao 'points 12 34)
</pre>
</div>

<p>
Consider a slightly more complicated version of country:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">defclass</span> <span style="color: #34cae2;">country-c</span> ()
  ((id <span style="color: #23d7d7;">:col-type</span> integer <span style="color: #23d7d7;">:col-identity</span> t <span style="color: #23d7d7;">:accessor</span> id)
   (name <span style="color: #23d7d7;">:col-type</span> string <span style="color: #23d7d7;">:col-unique</span> t <span style="color: #23d7d7;">:check</span> (<span style="color: #23d7d7;">:&lt;&gt;</span> 'name <span style="color: #e67128;">""</span>)
         <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:name</span> <span style="color: #23d7d7;">:reader</span> country-name)
   (inhabitants <span style="color: #23d7d7;">:col-type</span> integer <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:inhabitants</span>
                <span style="color: #23d7d7;">:accessor</span> country-inhabitants)
   (sovereign <span style="color: #23d7d7;">:col-type</span> (or db-null string) <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:sovereign</span>
              <span style="color: #23d7d7;">:accessor</span> country-sovereign)
   (region-id <span style="color: #23d7d7;">:col-type</span> integer <span style="color: #23d7d7;">:col-references</span> ((regions id))
              <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:region-id</span> <span style="color: #23d7d7;">:accessor</span> region-id))
  (<span style="color: #23d7d7;">:metaclass</span> dao-class)
  (<span style="color: #23d7d7;">:table-name</span> countries))
</pre>
</div>

<p>
In this example we have an id column which is specified to be an identity column.
Postgresql will automatically generate a sequence of of integers and this will
be the primary key.
</p>

<p>
We have a name column which is specified as unique and is not null and the
check will ensure that the database refuses to accept an empty string as the name.
</p>

<p>
We have a region-id column which references the id column in the regions table.
This is a foreign key constraint and Postgresql will not accept inserting a country
into the database unless there is an existing region with an id that matches this
number. Postgresql will also not allow deleting a region if there are countries
that reference that region's id. If we wanted Postgresql to delete countries when
regions are deleted, that column would be specified as:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(region-id <span style="color: #23d7d7;">:col-type</span> integer <span style="color: #23d7d7;">:col-references</span> ((regions id) <span style="color: #23d7d7;">:cascade</span>)
  <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:region-id</span> <span style="color: #23d7d7;">:accessor</span> region-id)
</pre>
</div>

<p>
Now you can see why the double parens.
</p>

<p>
We also specify that the table name is not "country" but "countries". (Some style guides
recommend that table names be plural and references to rows be singular.)
</p>
</div>
