doc/index.org
** Table Creation
   :PROPERTIES:
   :ID:       6ac2dcab-bd3b-48de-9ea0-fec010d76879
   :CUSTOM_ID: eccad49e-8df8-4451-89ff-4987b103c9dd
   :END:
*** With SQL or S-SQL
    :PROPERTIES:
    :CUSTOM_ID: 7629810d-8ccb-4236-b540-6aff596a042f
    :END:
You can create tables directly without the need to define a class, and in more
complicated cases, you may need to use the s-sql :create-table operator or plain
vanilla sql. Staying with examples that will match our slightly more complicated
dao-class above (but ignoring the fact that the references parameter would
actually require us to create the regions table first) and using s-sql rather
than plain vanilla sql would be the following:
#+BEGIN_SRC lisp
(query (:create-table 'countries
      ((id :type integer  :primary-key t :identity-always t)
       (name :type string :unique t :check (:<> 'name ""))
       (inhabitants :type integer)
       (sovereign :type (or db-null string))
       (region-id :type integer :references ((regions id))))))
#+END_SRC

Restated using vanilla sql:
#+BEGIN_SRC sql
(query "CREATE TABLE countries (
           id INTEGER NOT NULL PRIMARY KEY GENERATED ALWAYS AS IDENTITY,
           name TEXT NOT NULL UNIQUE CHECK (NAME <> E''),
           inhabitants INTEGER NOT NULL,
           sovereign TEXT,
           region_id INTEGER NOT NULL REFERENCES regions(id)
             MATCH SIMPLE ON DELETE RESTRICT ON UPDATE RESTRICT)")
#+END_SRC
Let's look at a slightly different example:
#+BEGIN_SRC lisp
(query (:create-table so-items
         ((item-id :type integer)
          (so-id :type (or integer db-null) :references ((so-headers id)))
          (product-id :type (or integer db-null))
          (qty :type (or integer db-null))
          (net-price :type (or numeric db-null)))
         (:primary-key item-id so-id)))
#+END_SRC

Restated using plain sql:
#+BEGIN_SRC sql
(query "CREATE TABLE so_items (
           item_id INTEGER NOT NULL,
           so_id INTEGER REFERENCES so_headers(id)
                 MATCH SIMPLE ON DELETE RESTRICT ON UPDATE RESTRICT,
           product_id INTEGER,
           qty INTEGER,
           net_price NUMERIC,
           PRIMARY KEY (item_id, so_id)
     );")
#+END_SRC
In the above case, the new table's name will be so_items because sql does not
allow hyphens and plain vanilla sql will require that. Postmodern will
generally allow you to use the quoted symbol 'so-items. This is also true for
all the column names. The column item-id is an integer and cannot be null. The
column so-id is also an integer, but is allowed to be null and is a foreign key
to the id field in the so-headers table so-headers. The primary key is actually
a composite of item-id and so-id. (If we wanted the primary key to be just
item-id, we could have specified that in the form defining item-id.)

For more detail and examples on building tables using the s-sql approach,
see [[file:create-tables.html][create-tables.html]]

*** With a Previously Created DAO
    :PROPERTIES:
    :CUSTOM_ID: 5129ed89-2ff3-45b4-ae70-41c2c286eacc
    :END:
You can also use a previously defined dao to create a table as well. The
dao-table-definition function examines a dao class and generates the plain vanilla
sql for creating a table. That can be passed on to the execute function to create
a table. For example the simple country dao would generate:
#+BEGIN_SRC lisp
(dao-table-definition 'country)

"CREATE TABLE country
  (name TEXT NOT NULL,
   inhabitants INTEGER NOT NULL,
   sovereign TEXT DEFAULT NULL,
  PRIMARY KEY (name))"

(execute (dao-table-definition 'country))
#+END_SRC
(Execute works like query, but does not expect any results back.)

The slightly more complicated country-c version would generate:
#+BEGIN_SRC lisp
(dao-table-definition 'country-c)

;; => "CREATE TABLE countries (
;;       id INTEGER NOT NULL PRIMARY KEY generated always as identity,
;;       name TEXT NOT NULL UNIQUE,
;;       inhabitants INTEGER NOT NULL,
;;       sovereign TEXT DEFAULT NULL,
;;       region_id INTEGER NOT NULL REFERENCES regions(id)
;;         MATCH SIMPLE ON DELETE RESTRICT ON UPDATE RESTRICT)

(execute (dao-table-definition 'country-c))
#+END_SRC
For the rest of the discussion on this page, we will use the simpler version
and save the more complicated version for the [[file:postmodern.html][postmodern]] manuals.

