doc/index.html

<div id="outline-container-eccad49e-8df8-4451-89ff-4987b103c9dd" class="outline-3">
<h3 id="eccad49e-8df8-4451-89ff-4987b103c9dd">Table Creation</h3>
<div class="outline-text-3" id="text-eccad49e-8df8-4451-89ff-4987b103c9dd">
</div>
<div id="outline-container-7629810d-8ccb-4236-b540-6aff596a042f" class="outline-4">
<h4 id="7629810d-8ccb-4236-b540-6aff596a042f">With SQL or S-SQL</h4>
<div class="outline-text-4" id="text-7629810d-8ccb-4236-b540-6aff596a042f">
<p>
You can create tables directly without the need to define a class, and in more
complicated cases, you may need to use the s-sql :create-table operator or plain
vanilla sql. Staying with examples that will match our slightly more complicated
dao-class above (but ignoring the fact that the references parameter would
actually require us to create the regions table first) and using s-sql rather
than plain vanilla sql would be the following:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:create-table</span> 'countries
      ((id <span style="color: #23d7d7;">:type</span> integer  <span style="color: #23d7d7;">:primary-key</span> t <span style="color: #23d7d7;">:identity-always</span> t)
       (name <span style="color: #23d7d7;">:type</span> string <span style="color: #23d7d7;">:unique</span> t <span style="color: #23d7d7;">:check</span> (<span style="color: #23d7d7;">:&lt;&gt;</span> 'name <span style="color: #e67128;">""</span>))
       (inhabitants <span style="color: #23d7d7;">:type</span> integer)
       (sovereign <span style="color: #23d7d7;">:type</span> (or db-null string))
       (region-id <span style="color: #23d7d7;">:type</span> integer <span style="color: #23d7d7;">:references</span> ((regions id))))))
</pre>
</div>

<p>
Restated using vanilla sql:
</p>
<div class="org-src-container">
<pre class="src src-sql">(query "<span style="color: #ffad29; font-weight: bold;">CREATE</span> <span style="color: #ffad29; font-weight: bold;">TABLE</span> countries (
           id <span style="color: #34cae2;">INTEGER</span> <span style="color: #ffad29; font-weight: bold;">NOT</span> <span style="color: #ffad29; font-weight: bold;">NULL</span> <span style="color: #ffad29; font-weight: bold;">PRIMARY</span> <span style="color: #ffad29; font-weight: bold;">KEY</span> <span style="color: #ffad29; font-weight: bold;">GENERATED</span> ALWAYS <span style="color: #ffad29; font-weight: bold;">AS</span> <span style="color: #ffad29; font-weight: bold;">IDENTITY</span>,
           <span style="color: #ffad29; font-weight: bold;">name</span> TEXT <span style="color: #ffad29; font-weight: bold;">NOT</span> <span style="color: #ffad29; font-weight: bold;">NULL</span> <span style="color: #ffad29; font-weight: bold;">UNIQUE</span> <span style="color: #ffad29; font-weight: bold;">CHECK</span> (<span style="color: #ffad29; font-weight: bold;">NAME</span> &lt;&gt; E<span style="color: #e67128;">''</span>),
           inhabitants <span style="color: #34cae2;">INTEGER</span> <span style="color: #ffad29; font-weight: bold;">NOT</span> <span style="color: #ffad29; font-weight: bold;">NULL</span>,
           sovereign TEXT,
           region_id <span style="color: #34cae2;">INTEGER</span> <span style="color: #ffad29; font-weight: bold;">NOT</span> <span style="color: #ffad29; font-weight: bold;">NULL</span> <span style="color: #ffad29; font-weight: bold;">REFERENCES</span> regions(id)
             <span style="color: #ffad29; font-weight: bold;">MATCH</span> <span style="color: #ffad29; font-weight: bold;">SIMPLE</span> <span style="color: #ffad29; font-weight: bold;">ON</span> <span style="color: #ffad29; font-weight: bold;">DELETE</span> <span style="color: #ffad29; font-weight: bold;">RESTRICT</span> <span style="color: #ffad29; font-weight: bold;">ON</span> <span style="color: #ffad29; font-weight: bold;">UPDATE</span> <span style="color: #ffad29; font-weight: bold;">RESTRICT</span>)")
</pre>
</div>
<p>
Let's look at a slightly different example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:create-table</span> so-items
         ((item-id <span style="color: #23d7d7;">:type</span> integer)
          (so-id <span style="color: #23d7d7;">:type</span> (or integer db-null) <span style="color: #23d7d7;">:references</span> ((so-headers id)))
          (product-id <span style="color: #23d7d7;">:type</span> (or integer db-null))
          (qty <span style="color: #23d7d7;">:type</span> (or integer db-null))
          (net-price <span style="color: #23d7d7;">:type</span> (or numeric db-null)))
         (<span style="color: #23d7d7;">:primary-key</span> item-id so-id)))
</pre>
</div>

<p>
Restated using plain sql:
</p>
<div class="org-src-container">
<pre class="src src-sql">(query "<span style="color: #ffad29; font-weight: bold;">CREATE</span> <span style="color: #ffad29; font-weight: bold;">TABLE</span> so_items (
           item_id <span style="color: #34cae2;">INTEGER</span> <span style="color: #ffad29; font-weight: bold;">NOT</span> <span style="color: #ffad29; font-weight: bold;">NULL</span>,
           so_id <span style="color: #34cae2;">INTEGER</span> <span style="color: #ffad29; font-weight: bold;">REFERENCES</span> so_headers(id)
                 <span style="color: #ffad29; font-weight: bold;">MATCH</span> <span style="color: #ffad29; font-weight: bold;">SIMPLE</span> <span style="color: #ffad29; font-weight: bold;">ON</span> <span style="color: #ffad29; font-weight: bold;">DELETE</span> <span style="color: #ffad29; font-weight: bold;">RESTRICT</span> <span style="color: #ffad29; font-weight: bold;">ON</span> <span style="color: #ffad29; font-weight: bold;">UPDATE</span> <span style="color: #ffad29; font-weight: bold;">RESTRICT</span>,
           product_id <span style="color: #34cae2;">INTEGER</span>,
           qty <span style="color: #34cae2;">INTEGER</span>,
           net_price <span style="color: #34cae2;">NUMERIC</span>,
           <span style="color: #ffad29; font-weight: bold;">PRIMARY</span> <span style="color: #ffad29; font-weight: bold;">KEY</span> (item_id, so_id)
     );")
</pre>
</div>
<p>
In the above case, the new table's name will be so_items because sql does not
allow hyphens and plain vanilla sql will require that. Postmodern will
generally allow you to use the quoted symbol 'so-items. This is also true for
all the column names. The column item-id is an integer and cannot be null. The
column so-id is also an integer, but is allowed to be null and is a foreign key
to the id field in the so-headers table so-headers. The primary key is actually
a composite of item-id and so-id. (If we wanted the primary key to be just
item-id, we could have specified that in the form defining item-id.)
</p>

<p>
For more detail and examples on building tables using the s-sql approach,
see <a href="create-tables.html">create-tables.html</a>
</p>
</div>
</div>

<div id="outline-container-5129ed89-2ff3-45b4-ae70-41c2c286eacc" class="outline-4">
<h4 id="5129ed89-2ff3-45b4-ae70-41c2c286eacc">With a Previously Created DAO</h4>
<div class="outline-text-4" id="text-5129ed89-2ff3-45b4-ae70-41c2c286eacc">
<p>
You can also use a previously defined dao to create a table as well. The
dao-table-definition function examines a dao class and generates the plain vanilla
sql for creating a table. That can be passed on to the execute function to create
a table. For example the simple country dao would generate:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(dao-table-definition 'country)

<span style="color: #e67128;">"CREATE TABLE country</span>
<span style="color: #e67128;">  (name TEXT NOT NULL,</span>
<span style="color: #e67128;">   inhabitants INTEGER NOT NULL,</span>
<span style="color: #e67128;">   sovereign TEXT DEFAULT NULL,</span>
<span style="color: #e67128;">  PRIMARY KEY (name))"</span>

(execute (dao-table-definition 'country))
</pre>
</div>
<p>
(Execute works like query, but does not expect any results back.)
</p>

<p>
The slightly more complicated country-c version would generate:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(dao-table-definition 'country-c)

<span style="color: #74af68;">;; </span><span style="color: #74af68;">=&gt; "CREATE TABLE countries (</span>
<span style="color: #74af68;">;;       </span><span style="color: #74af68;">id INTEGER NOT NULL PRIMARY KEY generated always as identity,</span>
<span style="color: #74af68;">;;       </span><span style="color: #74af68;">name TEXT NOT NULL UNIQUE,</span>
<span style="color: #74af68;">;;       </span><span style="color: #74af68;">inhabitants INTEGER NOT NULL,</span>
<span style="color: #74af68;">;;       </span><span style="color: #74af68;">sovereign TEXT DEFAULT NULL,</span>
<span style="color: #74af68;">;;       </span><span style="color: #74af68;">region_id INTEGER NOT NULL REFERENCES regions(id)</span>
<span style="color: #74af68;">;;         </span><span style="color: #74af68;">MATCH SIMPLE ON DELETE RESTRICT ON UPDATE RESTRICT)</span>

(execute (dao-table-definition 'country-c))
</pre>
</div>
<p>
For the rest of the discussion on this page, we will use the simpler version
and save the more complicated version for the <a href="postmodern.html">postmodern</a> manuals.
</p>
</div>
</div>
</div>
