doc/index.org
** Inserting Data
   :PROPERTIES:
   :ID:       980103dd-9593-4047-9954-92e80f3785a9
   :CUSTOM_ID: 0b22f6d2-20e4-49cd-a311-083aade58cbf
   :END:
Similarly to table creation, you can insert data using the s-sql wrapper, plain
vanilla sql or daos.

The s-sql approach would be:

#+BEGIN_SRC lisp
(query (:insert-into 'country :set 'name "The Netherlands"
                                   'inhabitants 16800000
                                   'sovereign "Willem-Alexander"))

(query (:insert-into 'country :set 'name "Croatia"
                                   'inhabitants 4400000))
#+END_SRC

You could also insert multiple rows at a time but that requires the same columns for each row:

#+BEGIN_SRC lisp
(query (:insert-rows-into 'country :columns 'name 'inhabitants 'sovereign
                                   :values '(("The Netherlands" 16800000 "Willem-Alexander")
                                             ("Croatia" 4400000 :null))))
#+END_SRC

The sql approach would be:
#+BEGIN_SRC lisp
(query "insert into country (name, inhabitants, sovereign)
                            values ('The Netherlands', 16800000, 'Willem-Alexander')")

(query "insert into country (name, inhabitants)
                            values ('Croatia', 4400000)")
#+END_SRC

The multiple row sql approach would be:
#+BEGIN_SRC lisp
(query "insert into country (name, inhabitants, sovereign)
                            values
                              ('The Netherlands', 16800000, 'Willem-Alexander'),
                              ('Croatia', 4400000, NULL)")
#+END_SRC

Using dao classes would look like:
Let us go back to our approach using a dao class and add a few countries:
#+BEGIN_SRC lisp
(insert-dao (make-instance 'country :name "The Netherlands"
                                    :inhabitants 16800000
                                    :sovereign "Willem-Alexander"))
(insert-dao (make-instance 'country :name "Croatia"
                                    :inhabitants 4400000))
#+END_SRC
Postmodern does not yet have an insert-daos (plural) function.

Staying with the dao class approach, to update Croatia's population, we could do this:
#+BEGIN_SRC lisp
(let ((croatia (get-dao 'country "Croatia")))
  (setf (country-inhabitants croatia) 4500000)
  (update-dao croatia))
(query (:select '* :from 'country))

;; => (("The Netherlands" 16800000 "Willem-Alexander")
;;     ("Croatia" 4500000 :NULL))
#+END_SRC
Please see the documentation for s-sql for more examples of using s-sql rather than daos.

Next, to demonstrate a bit more of the S-SQL syntax, here is the query the
utility function list-tables uses to get a list of the tables in a database:
#+BEGIN_SRC lisp
(sql (:select 'relname :from 'pg-catalog.pg-class
      :inner-join 'pg-catalog.pg-namespace :on (:= 'relnamespace
                                                   'pg-namespace.oid)
      :where (:and (:= 'relkind "r")
                   (:not-in 'nspname (:set "pg_catalog" "pg_toast"))
                   (:pg-catalog.pg-table-is-visible 'pg-class.oid))))

;; => "(SELECT relname FROM pg_catalog.pg_class
;;      INNER JOIN pg_catalog.pg_namespace ON (relnamespace = pg_namespace.oid)
;;      WHERE ((relkind = 'r') and (nspname NOT IN ('pg_catalog', 'pg_toast'))
;;             and pg_catalog.pg_table_is_visible(pg_class.oid)))"
#+END_SRC

sql is a macro that will simply compile a query, it can be useful for seeing
how your queries are expanded or if you want to do something unexpected with
them.

As you can see, lists starting with keywords are used to express SQL commands
and operators (lists starting with something else will be evaluated and then
inserted into the query). Quoted symbols name columns or tables (keywords can
also be used but might introduce ambiguities). The syntax supports subqueries,
multiple joins, stored procedures, etc. See the [[file:s-sql.html][S-SQL reference manual]] for a
complete treatment.

Finally, here is an example of the use of prepared statements:
#+BEGIN_SRC lisp
(defprepared sovereign-of
  (:select 'sovereign :from 'country :where (:= 'name '$1))
  :single!)
(sovereign-of "The Netherlands")
;; => "Willem-Alexander"
#+END_SRC

The defprepared macro creates a function that takes the same amount of
arguments as there are $X placeholders in the given query. The query will
only be parsed and planned once (per database connection), which can be
faster, especially for complex queries.
#+BEGIN_SRC lisp
(disconnect-toplevel)
#+END_SRC

* Authentication
  :PROPERTIES:
  :ID:       5ad46584-6887-4866-9c40-633768c0d39a
  :CUSTOM_ID: b15533d8-efa3-43a9-b632-a3256cea261f
  :END:
Postmodern can use either md5 or scram-sha-256 authentication. Scram-sha-256
authentication is obviously more secure, but slower than md5, so take that into
account if you are planning on opening and closing many connections without
using a connection pooling setup..

Other authentication methods have not been tested. Please let us know if there
is a authentication method that you believe should be considered.

* Reference
  :PROPERTIES:
  :ID:       27b39236-15ee-42c3-958a-3c9c903c4567
  :CUSTOM_ID: 8993c7bd-4ba2-4080-8c5a-ff90de45eca5
  :END:
The reference manuals for the different components of Postmodern are kept
in separate files. For using the library in the most straightforward way,
you only really need to read the Postmodern reference and glance over the
S-SQL reference. The simple-date reference explains the time-related data
types included in Postmodern, and the CL-postgres reference might be useful
if you just want a low-level library for talking to a PostgreSQL server.

- [[file:postmodern.html][Postmodern]]
- [[file:s-sql.html][S-SQL]]
- [[file:simple-date.html][Simple-date]]
- [[file:cl-postgres.html][CL-postgres]]

Some specific topics in more detail

- [[file:array-notes.html][Array-Notes]]
- [[file:create-tables.html][Creating Tables]]
- [[file:dao-classes.html][Database Access Object (Dao) Classes]]
- [[file:dynamic-queries.html][Dynamic Queries]]
- [[file:interval-notes.html][Interval Notes]]
- [[file:isolation-notes.html][Isolation Notes]]

* Data Types
  :PROPERTIES:
  :ID:       d089d05b-4485-4fb5-9097-5a66492bc470
  :CUSTOM_ID: e2475974-6131-40ef-9ca3-54bf111a5dd0
  :END:
