doc/index.html

<div id="outline-container-0b22f6d2-20e4-49cd-a311-083aade58cbf" class="outline-3">
<h3 id="0b22f6d2-20e4-49cd-a311-083aade58cbf">Inserting Data</h3>
<div class="outline-text-3" id="text-0b22f6d2-20e4-49cd-a311-083aade58cbf">
<p>
Similarly to table creation, you can insert data using the s-sql wrapper, plain
vanilla sql or daos.
</p>

<p>
The s-sql approach would be:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:insert-into</span> 'country <span style="color: #23d7d7;">:set</span> 'name <span style="color: #e67128;">"The Netherlands"</span>
                                   'inhabitants 16800000
                                   'sovereign <span style="color: #e67128;">"Willem-Alexander"</span>))

(query (<span style="color: #23d7d7;">:insert-into</span> 'country <span style="color: #23d7d7;">:set</span> 'name <span style="color: #e67128;">"Croatia"</span>
                                   'inhabitants 4400000))
</pre>
</div>

<p>
You could also insert multiple rows at a time but that requires the same columns for each row:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:insert-rows-into</span> 'country <span style="color: #23d7d7;">:columns</span> 'name 'inhabitants 'sovereign
                                   <span style="color: #23d7d7;">:values</span> '((<span style="color: #e67128;">"The Netherlands"</span> 16800000 <span style="color: #e67128;">"Willem-Alexander"</span>)
                                             (<span style="color: #e67128;">"Croatia"</span> 4400000 <span style="color: #23d7d7;">:null</span>))))
</pre>
</div>

<p>
The sql approach would be:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query <span style="color: #e67128;">"insert into country (name, inhabitants, sovereign)</span>
<span style="color: #e67128;">                            values ('The Netherlands', 16800000, 'Willem-Alexander')"</span>)

(query <span style="color: #e67128;">"insert into country (name, inhabitants)</span>
<span style="color: #e67128;">                            values ('Croatia', 4400000)"</span>)
</pre>
</div>

<p>
The multiple row sql approach would be:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query <span style="color: #e67128;">"insert into country (name, inhabitants, sovereign)</span>
<span style="color: #e67128;">                            values</span>
<span style="color: #e67128;">                              ('The Netherlands', 16800000, 'Willem-Alexander'),</span>
<span style="color: #e67128;">                              ('Croatia', 4400000, NULL)"</span>)
</pre>
</div>

<p>
Using dao classes would look like:
Let us go back to our approach using a dao class and add a few countries:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(insert-dao (make-instance 'country <span style="color: #23d7d7;">:name</span> <span style="color: #e67128;">"The Netherlands"</span>
                                    <span style="color: #23d7d7;">:inhabitants</span> 16800000
                                    <span style="color: #23d7d7;">:sovereign</span> <span style="color: #e67128;">"Willem-Alexander"</span>))
(insert-dao (make-instance 'country <span style="color: #23d7d7;">:name</span> <span style="color: #e67128;">"Croatia"</span>
                                    <span style="color: #23d7d7;">:inhabitants</span> 4400000))
</pre>
</div>
<p>
Postmodern does not yet have an insert-daos (plural) function.
</p>

<p>
Staying with the dao class approach, to update Croatia's population, we could do this:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">let</span> ((croatia (get-dao 'country <span style="color: #e67128;">"Croatia"</span>)))
  (setf (country-inhabitants croatia) 4500000)
  (update-dao croatia))
(query (<span style="color: #23d7d7;">:select</span> '* <span style="color: #23d7d7;">:from</span> 'country))

<span style="color: #74af68;">;; </span><span style="color: #74af68;">=&gt; (("The Netherlands" 16800000 "Willem-Alexander")</span>
<span style="color: #74af68;">;;     </span><span style="color: #74af68;">("Croatia" 4500000 :NULL))</span>
</pre>
</div>
<p>
Please see the documentation for s-sql for more examples of using s-sql rather than daos.
</p>

<p>
Next, to demonstrate a bit more of the S-SQL syntax, here is the query the
utility function list-tables uses to get a list of the tables in a database:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(sql (<span style="color: #23d7d7;">:select</span> 'relname <span style="color: #23d7d7;">:from</span> 'pg-catalog.pg-class
      <span style="color: #23d7d7;">:inner-join</span> 'pg-catalog.pg-namespace <span style="color: #23d7d7;">:on</span> (<span style="color: #23d7d7;">:=</span> 'relnamespace
                                                   'pg-namespace.oid)
      <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:and</span> (<span style="color: #23d7d7;">:=</span> 'relkind <span style="color: #e67128;">"r"</span>)
                   (<span style="color: #23d7d7;">:not-in</span> 'nspname (<span style="color: #23d7d7;">:set</span> <span style="color: #e67128;">"pg_catalog"</span> <span style="color: #e67128;">"pg_toast"</span>))
                   (<span style="color: #23d7d7;">:pg-catalog.pg-table-is-visible</span> 'pg-class.oid))))

<span style="color: #74af68;">;; </span><span style="color: #74af68;">=&gt; "(SELECT relname FROM pg_catalog.pg_class</span>
<span style="color: #74af68;">;;      </span><span style="color: #74af68;">INNER JOIN pg_catalog.pg_namespace ON (relnamespace = pg_namespace.oid)</span>
<span style="color: #74af68;">;;      </span><span style="color: #74af68;">WHERE ((relkind = 'r') and (nspname NOT IN ('pg_catalog', 'pg_toast'))</span>
<span style="color: #74af68;">;;             </span><span style="color: #74af68;">and pg_catalog.pg_table_is_visible(pg_class.oid)))"</span>
</pre>
</div>

<p>
sql is a macro that will simply compile a query, it can be useful for seeing
how your queries are expanded or if you want to do something unexpected with
them.
</p>

<p>
As you can see, lists starting with keywords are used to express SQL commands
and operators (lists starting with something else will be evaluated and then
inserted into the query). Quoted symbols name columns or tables (keywords can
also be used but might introduce ambiguities). The syntax supports subqueries,
multiple joins, stored procedures, etc. See the <a href="s-sql.html">S-SQL reference manual</a> for a
complete treatment.
</p>

<p>
Finally, here is an example of the use of prepared statements:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(defprepared sovereign-of
  (<span style="color: #23d7d7;">:select</span> 'sovereign <span style="color: #23d7d7;">:from</span> 'country <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'name '$1))
  <span style="color: #23d7d7;">:single!</span>)
(sovereign-of <span style="color: #e67128;">"The Netherlands"</span>)
<span style="color: #74af68;">;; </span><span style="color: #74af68;">=&gt; "Willem-Alexander"</span>
</pre>
</div>

<p>
The defprepared macro creates a function that takes the same amount of
arguments as there are $X placeholders in the given query. The query will
only be parsed and planned once (per database connection), which can be
faster, especially for complex queries.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(disconnect-toplevel)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-b15533d8-efa3-43a9-b632-a3256cea261f" class="outline-2">
<h2 id="b15533d8-efa3-43a9-b632-a3256cea261f">Authentication</h2>
<div class="outline-text-2" id="text-b15533d8-efa3-43a9-b632-a3256cea261f">
<p>
Postmodern can use either md5 or scram-sha-256 authentication. Scram-sha-256
authentication is obviously more secure, but slower than md5, so take that into
account if you are planning on opening and closing many connections without
using a connection pooling setup..
</p>

<p>
Other authentication methods have not been tested. Please let us know if there
is a authentication method that you believe should be considered.
</p>
</div>
</div>

<div id="outline-container-8993c7bd-4ba2-4080-8c5a-ff90de45eca5" class="outline-2">
<h2 id="8993c7bd-4ba2-4080-8c5a-ff90de45eca5">Reference</h2>
<div class="outline-text-2" id="text-8993c7bd-4ba2-4080-8c5a-ff90de45eca5">
<p>
The reference manuals for the different components of Postmodern are kept
in separate files. For using the library in the most straightforward way,
you only really need to read the Postmodern reference and glance over the
S-SQL reference. The simple-date reference explains the time-related data
types included in Postmodern, and the CL-postgres reference might be useful
if you just want a low-level library for talking to a PostgreSQL server.
</p>

<ul class="org-ul">
<li><a href="postmodern.html">Postmodern</a></li>
<li><a href="s-sql.html">S-SQL</a></li>
<li><a href="simple-date.html">Simple-date</a></li>
<li><a href="cl-postgres.html">CL-postgres</a></li>
</ul>

<p>
Some specific topics in more detail
</p>

<ul class="org-ul">
<li><a href="array-notes.html">Array-Notes</a></li>
<li><a href="create-tables.html">Creating Tables</a></li>
<li><a href="dao-classes.html">Database Access Object (Dao) Classes</a></li>
<li><a href="dynamic-queries.html">Dynamic Queries</a></li>
<li><a href="interval-notes.html">Interval Notes</a></li>
<li><a href="isolation-notes.html">Isolation Notes</a></li>
</ul>
</div>
</div>
