doc/index.org
** Data Types
   :PROPERTIES:
   :ID:       deae4656-1b87-4518-9718-3b3e8c35f6c5
   :CUSTOM_ID: b850ea6c-b61e-4601-8423-65a8a626cb58
   :END:
For a short comparison of lisp and Postgresql data types (date and time datatypes are described in the next section)

| SQL type         | Description                                                       |
|------------------+-------------------------------------------------------------------|
| smallint         | -32,768 to +32,768 2-byte storage                                 |
| integer          | -2147483648 to +2147483647 integer, 4-byte storage                |
| bigint           | -9223372036854775808 to 9223372036854775807 8-byte storage        |
| numeric(X, Y)    | User specified, see notes below                                   |
| real             | float, 6 decimal digit precision 4-byte storage                   |
| double-precision | floating, 15 decimal digit precision 8-byte storage               |
| text             | variable length string, no limit specified                        |
| char(X)          | char(length), blank-padded string, fixed storage length           |
| varchar(X)       | varchar(length), non-blank-padded string, variable storage length |
| boolean          | boolean, 'true'/'false', 1 byte                                   |
| bytea            | binary string allowing non-printable octets                       |
| date             | date range: 4713 BC to 5874897 AD                                 |
| interval         | See [[file:interval-notes.html][interval]]                                                      |
| array            | See discussion at [[file:array-notes.html][array-notes.html]]                                |

Numeric and decimal are variable storage size numbers with user specified precision.
Up to 131072 digits before the decimal point; up to 16383 digits after the decimal point.
The syntax is numeric(precision, scale). Numeric columns with a specified scale will coerce input
values to that scale. For more detail, see https://www.postgresql.org/docs/current/datatype-numeric.html

| PG Type          | Sample Postmodern Return Value                                              | Lisp Type (per sbcl)                 |
|------------------+-----------------------------------------------------------------------------+--------------------------------------|
| boolean          | T                                                                           | BOOLEAN                              |
| boolean          | NIL  (Note: within Postgresql this will show 'f')                           | BOOLEAN                              |
| int2             | 273                                                                         | (INTEGER 0 4611686018427387903)      |
| int4             | 2                                                                           | (INTEGER 0 4611686018427387903)      |
| char             | A                                                                           | (VECTOR CHARACTER 64)                |
| varchar          | id&wl;19                                                                    | (VECTOR CHARACTER 64)                |
| numeric          | 78239/100                                                                   | RATIO                                |
| json             | { "customer": "John Doe", "items": {"product": "Beer","qty": 6}}            | (VECTOR CHARACTER 64)                |
| jsonb            | {"title": "Sleeping Beauties", "genres": ["Fiction", "Thriller", "Horror"]} | (VECTOR CHARACTER 128)               |
| float            | 782.31                                                                      | SINGLE-FLOAT                         |
| point            | (0.0d0 0.0d0)                                                               | CONS                                 |
| lseg             | ((-1.0d0 0.0d0) (2.0d0 4.0d0))                                              | CONS                                 |
| path             | ((1,0),(2,4))                                                               | (VECTOR CHARACTER 64)                |
| box              | ((1.0d0 1.0d0) (0.0d0 0.0d0))                                               | CONS                                 |
| polygon          | ((21,0),(2,4))                                                              | (VECTOR CHARACTER 64)                |
| line             | {2,-1,0}                                                                    | (VECTOR CHARACTER 64)                |
| double_precision | 2.38921379231d8                                                             | DOUBLE-FLOAT                         |
| double_float     | 2.3892137923231d8                                                           | DOUBLE-FLOAT                         |
| circle           | <(0,0),2>                                                                   | (VECTOR CHARACTER 64)                |
| cidr             | 100.24.10.0/24                                                              | (VECTOR CHARACTER 64)                |
| inet             | 100.24.10.0/24                                                              | (VECTOR CHARACTER 64)                |
| interval         | #<INTERVAL P1Y3H20m>                                                        | INTERVAL                             |
| bit              | #*1                                                                         | (SIMPLE-BIT-VECTOR 1)                |
| int4range        | [11,24)                                                                     | (VECTOR CHARACTER 64)                |
| uuid             | 40e6215d-b5c6-4896-987c-f30f3678f608                                        | (VECTOR CHARACTER 64)                |
| text_array       | #(text one text two text three)                                             | (SIMPLE-VECTOR 3)                    |
| integer_array    | #(3 5 7 8)                                                                  | (SIMPLE-VECTOR 4)                    |
| bytea            | #(222 173 190 239)                                                          | (SIMPLE-ARRAY (UNSIGNED-BYTE 8) (4)) |
| text             | Lorem ipsum dolor sit amet, consectetur adipiscing elit                     | (VECTOR CHARACTER 64)                |
| enum_mood        | happy *Note: enum_mood was defined as 'sad','ok' or 'happy'                 | (VECTOR CHARACTER 64)                |

