doc/index.html

<div id="outline-container-e2475974-6131-40ef-9ca3-54bf111a5dd0" class="outline-2">
<h2 id="e2475974-6131-40ef-9ca3-54bf111a5dd0">Data Types</h2>
<div class="outline-text-2" id="text-e2475974-6131-40ef-9ca3-54bf111a5dd0">
</div>
<div id="outline-container-b850ea6c-b61e-4601-8423-65a8a626cb58" class="outline-3">
<h3 id="b850ea6c-b61e-4601-8423-65a8a626cb58">Data Types</h3>
<div class="outline-text-3" id="text-b850ea6c-b61e-4601-8423-65a8a626cb58">
<p>
For a short comparison of lisp and Postgresql data types (date and time datatypes are described in the next section)
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">SQL type</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">smallint</td>
<td class="org-left">-32,768 to +32,768 2-byte storage</td>
</tr>

<tr>
<td class="org-left">integer</td>
<td class="org-left">-2147483648 to +2147483647 integer, 4-byte storage</td>
</tr>

<tr>
<td class="org-left">bigint</td>
<td class="org-left">-9223372036854775808 to 9223372036854775807 8-byte storage</td>
</tr>

<tr>
<td class="org-left">numeric(X, Y)</td>
<td class="org-left">User specified, see notes below</td>
</tr>

<tr>
<td class="org-left">real</td>
<td class="org-left">float, 6 decimal digit precision 4-byte storage</td>
</tr>

<tr>
<td class="org-left">double-precision</td>
<td class="org-left">floating, 15 decimal digit precision 8-byte storage</td>
</tr>

<tr>
<td class="org-left">text</td>
<td class="org-left">variable length string, no limit specified</td>
</tr>

<tr>
<td class="org-left">char(X)</td>
<td class="org-left">char(length), blank-padded string, fixed storage length</td>
</tr>

<tr>
<td class="org-left">varchar(X)</td>
<td class="org-left">varchar(length), non-blank-padded string, variable storage length</td>
</tr>

<tr>
<td class="org-left">boolean</td>
<td class="org-left">boolean, 'true'/'false', 1 byte</td>
</tr>

<tr>
<td class="org-left">bytea</td>
<td class="org-left">binary string allowing non-printable octets</td>
</tr>

<tr>
<td class="org-left">date</td>
<td class="org-left">date range: 4713 BC to 5874897 AD</td>
</tr>

<tr>
<td class="org-left">interval</td>
<td class="org-left">See <a href="interval-notes.html">interval</a></td>
</tr>

<tr>
<td class="org-left">array</td>
<td class="org-left">See discussion at <a href="array-notes.html">array-notes.html</a></td>
</tr>
</tbody>
</table>

<p>
Numeric and decimal are variable storage size numbers with user specified precision.
Up to 131072 digits before the decimal point; up to 16383 digits after the decimal point.
The syntax is numeric(precision, scale). Numeric columns with a specified scale will coerce input
values to that scale. For more detail, see <a href="https://www.postgresql.org/docs/current/datatype-numeric.html">https://www.postgresql.org/docs/current/datatype-numeric.html</a>
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">PG Type</th>
<th scope="col" class="org-left">Sample Postmodern Return Value</th>
<th scope="col" class="org-left">Lisp Type (per sbcl)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">boolean</td>
<td class="org-left">T</td>
<td class="org-left">BOOLEAN</td>
</tr>

<tr>
<td class="org-left">boolean</td>
<td class="org-left">NIL  (Note: within Postgresql this will show 'f')</td>
<td class="org-left">BOOLEAN</td>
</tr>

<tr>
<td class="org-left">int2</td>
<td class="org-left">273</td>
<td class="org-left">(INTEGER 0 4611686018427387903)</td>
</tr>

<tr>
<td class="org-left">int4</td>
<td class="org-left">2</td>
<td class="org-left">(INTEGER 0 4611686018427387903)</td>
</tr>

<tr>
<td class="org-left">char</td>
<td class="org-left">A</td>
<td class="org-left">(VECTOR CHARACTER 64)</td>
</tr>

<tr>
<td class="org-left">varchar</td>
<td class="org-left">id&amp;wl;19</td>
<td class="org-left">(VECTOR CHARACTER 64)</td>
</tr>

<tr>
<td class="org-left">numeric</td>
<td class="org-left">78239/100</td>
<td class="org-left">RATIO</td>
</tr>

<tr>
<td class="org-left">json</td>
<td class="org-left">{ "customer": "John Doe", "items": {"product": "Beer","qty": 6}}</td>
<td class="org-left">(VECTOR CHARACTER 64)</td>
</tr>

<tr>
<td class="org-left">jsonb</td>
<td class="org-left">{"title": "Sleeping Beauties", "genres": ["Fiction", "Thriller", "Horror"]}</td>
<td class="org-left">(VECTOR CHARACTER 128)</td>
</tr>

<tr>
<td class="org-left">float</td>
<td class="org-left">782.31</td>
<td class="org-left">SINGLE-FLOAT</td>
</tr>

<tr>
<td class="org-left">point</td>
<td class="org-left">(0.0d0 0.0d0)</td>
<td class="org-left">CONS</td>
</tr>

<tr>
<td class="org-left">lseg</td>
<td class="org-left">((-1.0d0 0.0d0) (2.0d0 4.0d0))</td>
<td class="org-left">CONS</td>
</tr>

<tr>
<td class="org-left">path</td>
<td class="org-left">((1,0),(2,4))</td>
<td class="org-left">(VECTOR CHARACTER 64)</td>
</tr>

<tr>
<td class="org-left">box</td>
<td class="org-left">((1.0d0 1.0d0) (0.0d0 0.0d0))</td>
<td class="org-left">CONS</td>
</tr>

<tr>
<td class="org-left">polygon</td>
<td class="org-left">((21,0),(2,4))</td>
<td class="org-left">(VECTOR CHARACTER 64)</td>
</tr>

<tr>
<td class="org-left">line</td>
<td class="org-left">{2,-1,0}</td>
<td class="org-left">(VECTOR CHARACTER 64)</td>
</tr>

<tr>
<td class="org-left">double_precision</td>
<td class="org-left">2.38921379231d8</td>
<td class="org-left">DOUBLE-FLOAT</td>
</tr>

<tr>
<td class="org-left">double_float</td>
<td class="org-left">2.3892137923231d8</td>
<td class="org-left">DOUBLE-FLOAT</td>
</tr>

<tr>
<td class="org-left">circle</td>
<td class="org-left">&lt;(0,0),2&gt;</td>
<td class="org-left">(VECTOR CHARACTER 64)</td>
</tr>

<tr>
<td class="org-left">cidr</td>
<td class="org-left">100.24.10.0/24</td>
<td class="org-left">(VECTOR CHARACTER 64)</td>
</tr>

<tr>
<td class="org-left">inet</td>
<td class="org-left">100.24.10.0/24</td>
<td class="org-left">(VECTOR CHARACTER 64)</td>
</tr>

<tr>
<td class="org-left">interval</td>
<td class="org-left">#&lt;INTERVAL P1Y3H20m&gt;</td>
<td class="org-left">INTERVAL</td>
</tr>

<tr>
<td class="org-left">bit</td>
<td class="org-left">#*1</td>
<td class="org-left">(SIMPLE-BIT-VECTOR 1)</td>
</tr>

<tr>
<td class="org-left">int4range</td>
<td class="org-left">[11,24)</td>
<td class="org-left">(VECTOR CHARACTER 64)</td>
</tr>

<tr>
<td class="org-left">uuid</td>
<td class="org-left">40e6215d-b5c6-4896-987c-f30f3678f608</td>
<td class="org-left">(VECTOR CHARACTER 64)</td>
</tr>

<tr>
<td class="org-left">text_array</td>
<td class="org-left">#(text one text two text three)</td>
<td class="org-left">(SIMPLE-VECTOR 3)</td>
</tr>

<tr>
<td class="org-left">integer_array</td>
<td class="org-left">#(3 5 7 8)</td>
<td class="org-left">(SIMPLE-VECTOR 4)</td>
</tr>

<tr>
<td class="org-left">bytea</td>
<td class="org-left">#(222 173 190 239)</td>
<td class="org-left">(SIMPLE-ARRAY (UNSIGNED-BYTE 8) (4))</td>
</tr>

<tr>
<td class="org-left">text</td>
<td class="org-left">Lorem ipsum dolor sit amet, consectetur adipiscing elit</td>
<td class="org-left">(VECTOR CHARACTER 64)</td>
</tr>

<tr>
<td class="org-left">enum_mood</td>
<td class="org-left">happy *Note: enum_mood was defined as 'sad','ok' or 'happy'</td>
<td class="org-left">(VECTOR CHARACTER 64)</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
