doc/index.org
* Passing Parameters as Text or Binary
:PROPERTIES:
:CUSTOM_ID: passing-binary-parameters
:END:
To avoid sql injection attacks you should be using parameterized queries. They also help avoid the hassle of worrying about double quotes and single quotes. They are also a required part of prepared queries. The following shows an example of parameterized query in regular sql and s-sql.
#+begin_src lisp
(query "select name, address from customers where id = $1" 237)

(query (:select 'name 'address :from 'customers :where (:= 'id '$1)) 237)
#+end_src
Postmodern defaults to passing query parameters as text. In an example like the above, Postgresql would look at the customer table, see that "id" must be an integer or big integer and proceed accordingly. If Postgresql does not have a table column which would allow it to determine the appropriate data type and you do not specify the date type in the query, Postgresql treats the parameter as text. The following example in plain sql demonstrates:
#+BEGIN_SRC lisp
(query "select $1" 1 :single)
"1"
(query "select $1" 1.5 :single)
"1.5"
(query "select $1" T :single)
"true"
(query "select $1" nil :single)
"false"
(query "select $1" :NULL :single)
:NULL
#+END_SRC

You can specify the type and Postgresql will attempt to follow that:
#+begin_src lisp
(query "select $1::integer" 1 :single)
1
#+end_src
As of version 1.33, Postmodern provides an optional setting in the database connection object which will cause Postmodern to pass parameters to Postgresql in binary format if that format is available for that datatype. Currently this means int2, int4, int8, float, double-float (except clisp) and boolean. Rational numbers continue to be passed as text.

The default for cl-postgres/Postmodern is to continue to pass parameters to Postgresql as text (not in binary format) in order to avoid breaking existing user code. If you want to pass parameters to Postgresql in binary format, you can either provide the keyword parameter :use-binary in creating a connection like so:
#+begin_src lisp
  (connect "test-db" "test-user" "test-password" "192.168.5.223"
           :port 5434 :pooled-p t :use-ssl try :application-name "test-app" :use-binary t)
#+end_src
or use the postmodern =with-connection= macro:
#+begin_src lisp
  (with-connection '("database-name" "user-name" "user-password" "localhost or IP address"
                     :use-binary t [any other keyword parameters you want to apply])
    ...)
#+end_src
You can also change the flag after the connection is established with the =use-binary-parameters= function, passing T to use binary parameters or nil to use text parameters:
#+begin_src lisp
  (use-binary-parameters *database* t)

  (use-binary-parameters some-database-connection t)
#+end_src
Using binary parameters the results has the following results:
#+BEGIN_SRC lisp
(query "select $1" 1 :single)
1
(query "select $1" 1.5 :single)
1.5
(query "select $1" T :single)
T
(query "select $1" nil :single)
NIL
(query "select $1" :NULL :single)
:NULL
#+END_SRC
Using binary parameters does tighten type checking when using prepared queries. You will not be able to use prepared queries with varying formats. In other words, if you have a prepared query that you pass an integer as the first parameter and a string as the second parameter the first time it is used, any subsequent uses of that prepared query during that session will also have to pass an integer as the first parameter and a string as the second parameter.

Benchmarking does indicate a slight speed and consing benefit to passing parameters as binary, but your mileage will vary depending on your use case.

* Caveats and to-dos
  :PROPERTIES:
  :ID:       157ea05f-4c49-4e49-8cf9-a3df4bf16b09
  :CUSTOM_ID: fc095960-ba9d-4a98-ac89-0db7a56777f1
  :END:
