doc/index.html

<div id="outline-container-passing-binary-parameters" class="outline-2">
<h2 id="passing-binary-parameters">Passing Parameters as Text or Binary</h2>
<div class="outline-text-2" id="text-passing-binary-parameters">
<p>
To avoid sql injection attacks you should be using parameterized queries. They also help avoid the hassle of worrying about double quotes and single quotes. They are also a required part of prepared queries. The following shows an example of parameterized query in regular sql and s-sql.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query <span style="color: #e67128;">"select name, address from customers where id = $1"</span> 237)

(query (<span style="color: #23d7d7;">:select</span> 'name 'address <span style="color: #23d7d7;">:from</span> 'customers <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'id '$1)) 237)
</pre>
</div>
<p>
Postmodern defaults to passing query parameters as text. In an example like the above, Postgresql would look at the customer table, see that "id" must be an integer or big integer and proceed accordingly. If Postgresql does not have a table column which would allow it to determine the appropriate data type and you do not specify the date type in the query, Postgresql treats the parameter as text. The following example in plain sql demonstrates:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query <span style="color: #e67128;">"select $1"</span> 1 <span style="color: #23d7d7;">:single</span>)
<span style="color: #e67128;">"1"</span>
(query <span style="color: #e67128;">"select $1"</span> 1.5 <span style="color: #23d7d7;">:single</span>)
<span style="color: #e67128;">"1.5"</span>
(query <span style="color: #e67128;">"select $1"</span> T <span style="color: #23d7d7;">:single</span>)
<span style="color: #e67128;">"true"</span>
(query <span style="color: #e67128;">"select $1"</span> nil <span style="color: #23d7d7;">:single</span>)
<span style="color: #e67128;">"false"</span>
(query <span style="color: #e67128;">"select $1"</span> <span style="color: #23d7d7;">:NULL</span> <span style="color: #23d7d7;">:single</span>)
<span style="color: #23d7d7;">:NULL</span>
</pre>
</div>

<p>
You can specify the type and Postgresql will attempt to follow that:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query <span style="color: #e67128;">"select $1::integer"</span> 1 <span style="color: #23d7d7;">:single</span>)
1
</pre>
</div>
<p>
As of version 1.33, Postmodern provides an optional setting in the database connection object which will cause Postmodern to pass parameters to Postgresql in binary format if that format is available for that datatype. Currently this means int2, int4, int8, float, double-float (except clisp) and boolean. Rational numbers continue to be passed as text.
</p>

<p>
The default for cl-postgres/Postmodern is to continue to pass parameters to Postgresql as text (not in binary format) in order to avoid breaking existing user code. If you want to pass parameters to Postgresql in binary format, you can either provide the keyword parameter :use-binary in creating a connection like so:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(connect <span style="color: #e67128;">"test-db"</span> <span style="color: #e67128;">"test-user"</span> <span style="color: #e67128;">"test-password"</span> <span style="color: #e67128;">"192.168.5.223"</span>
         <span style="color: #23d7d7;">:port</span> 5434 <span style="color: #23d7d7;">:pooled-p</span> t <span style="color: #23d7d7;">:use-ssl</span> try <span style="color: #23d7d7;">:application-name</span> <span style="color: #e67128;">"test-app"</span> <span style="color: #23d7d7;">:use-binary</span> t)
</pre>
</div>
<p>
or use the postmodern <code>with-connection</code> macro:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">with-connection</span> '(<span style="color: #e67128;">"database-name"</span> <span style="color: #e67128;">"user-name"</span> <span style="color: #e67128;">"user-password"</span> <span style="color: #e67128;">"localhost or IP address"</span>
                   <span style="color: #23d7d7;">:use-binary</span> t [any other keyword parameters you want to apply])
  ...)
</pre>
</div>
<p>
You can also change the flag after the connection is established with the <code>use-binary-parameters</code> function, passing T to use binary parameters or nil to use text parameters:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(use-binary-parameters *database* t)

(use-binary-parameters some-database-connection t)
</pre>
</div>
<p>
Using binary parameters the results has the following results:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query <span style="color: #e67128;">"select $1"</span> 1 <span style="color: #23d7d7;">:single</span>)
1
(query <span style="color: #e67128;">"select $1"</span> 1.5 <span style="color: #23d7d7;">:single</span>)
1.5
(query <span style="color: #e67128;">"select $1"</span> T <span style="color: #23d7d7;">:single</span>)
T
(query <span style="color: #e67128;">"select $1"</span> nil <span style="color: #23d7d7;">:single</span>)
NIL
(query <span style="color: #e67128;">"select $1"</span> <span style="color: #23d7d7;">:NULL</span> <span style="color: #23d7d7;">:single</span>)
<span style="color: #23d7d7;">:NULL</span>
</pre>
</div>
<p>
Using binary parameters does tighten type checking when using prepared queries. You will not be able to use prepared queries with varying formats. In other words, if you have a prepared query that you pass an integer as the first parameter and a string as the second parameter the first time it is used, any subsequent uses of that prepared query during that session will also have to pass an integer as the first parameter and a string as the second parameter.
</p>

<p>
Benchmarking does indicate a slight speed and consing benefit to passing parameters as binary, but your mileage will vary depending on your use case.
</p>
</div>
</div>

<div id="outline-container-fc095960-ba9d-4a98-ac89-0db7a56777f1" class="outline-2">
<h2 id="fc095960-ba9d-4a98-ac89-0db7a56777f1">Caveats and to-dos</h2>
<div class="outline-text-2" id="text-fc095960-ba9d-4a98-ac89-0db7a56777f1">
</div>
