doc/index.org
** Timezones and Simple-Date and Local-Time
   :PROPERTIES:
   :ID:       8ff631c8-994f-4658-bbc4-779afc80bdf2
   :CUSTOM_ID: e5c68251-0ca6-4f96-8d36-175cec626eeb
   :END:
It is important to understand how postgresql (not postmodern) handles
timestamps and timestamps with time zones. Postgresql keeps everything
in UTC, it does not store a timezone even in a timezone aware column.
If you use a timestamp with timezone column, postgresql will calculate
the UTC time and will normalize the timestamp data to UTC. When you
later select the record, postgresql will look at the timezone for the
postgresql session, retrieve the data and then provide the data
recalculated from UTC to the timezone for that postgresql session.
There is a good writeup of timezones at
[[http://blog.untrod.com/2016/08/actually-understanding-timezones-in-postgresql.html]]
and [[http://phili.pe/posts/timestamps-and-time-zones-in-postgresql/][http://phili.pe/posts/timestamps-and-time-zones-in-postgresql/]].

Without simple-date or local-time properly loaded and without use of the
Postgresql to_char function, sample date and time data from postgresql will
look like:

| PG Type         |                                        Sample Return Value | Lisp Type                       |
|-----------------+------------------------------------------------------------+---------------------------------|
| date            |                                                 3798576000 | (INTEGER 0 4611686018427387903) |
| time_wo_tz      | ((HOURS 9) (MINUTES 47) (SECONDS 9) (MICROSECONDS 926531)) | CONS                            |
| time_w_tz       |                                         09:47:16.510459-04 | (VECTOR CHARACTER 64)           |
| timestamp_wo_tz |                                                 3798611253 | (INTEGER 0 4611686018427387903) |
| timestamp_w_tz  |                                                 3798625647 | (INTEGER 0 4611686018427387903) |

YOU DO NOT NEED TO ADD ANY OTHER LIBRARIES IF ALL YOU WANT TO DO IS GET ISO 8601 or
[[https://tools.ietf.org/html/rfc3339][RFC 3339]] PROPERLY FORMATTED TIME AND DATE STRINGS WITH THE [[https://www.postgresql.org/docs/current/functions-formatting.html][TO_CHAR]] POSTGRESQL
FUNCTION.

Assume a data table with columns  "col_timestamp_without_time_zone", "col_timestamp_with_time_zone", "col_timestamptz", "col_timestamp", "col_time"
and "col_date".

First, just basic sql. In this example we ask for the timestamp_with_time_zone field
three times to show differences in the result dealing with time zones. First we do not
add a timezone parameter to the pattern, the second time  we ask for the time zone
using TZ, the third time we ask for the offset from UTC and get back -04. We would get
the same result using those additional parameters with the col_timestamptz field.

#+BEGIN_SRC sql
(query "(SELECT to_char(col_timestamp_with_time_zone, E'YYYY-MM-DD HH24:MI:SS'),
                to_char(col_timestamp_with_time_zone, E'YYYY-MM-DD HH24:MI:SS TZ'),
                to_char(col_timestamp_with_time_zone, E'YYYY-MM-DD HH24:MI:SS OF'),
                to_char(col_timestamptz, E'YYYY-MM-DD HH24:MI:SS'),
                to_char(col_timestamp, E'YYYY-MM-DD HH24:MI:SS'),
                to_char(col_time, E'HH24:MI:SS'),
                to_char(col_date, E'YYYY-MM-DD')
         FROM short_data_type_tests
         WHERE (id = 1))")
(("2020-10-30 19:30:54" "2020-10-30 19:30:54 EDT" "2020-10-30 19:30:54 -04"
"2020-10-30 19:30:54" "2020-10-30 19:30:54" "19:30:54" "2020-10-30"))
#+END_SRC

Now the s-sql version:
#+BEGIN_SRC lisp
(query (:select  (:to-char 'col_timestamp_with_time_zone "YYYY-MM-DD HH24:MI:SS TZ")
                 (:to-char 'col_timestamp_with_time_zone "YYYY-MM-DD HH24:MI:SS OF")
                 (:to-char 'col_timestamptz "YYYY-MM-DD HH24:MI:SS")
                 (:to-char 'col_timestamp "YYYY-MM-DD HH24:MI:SS")
                 (:to-char 'col_time "HH24:MI:SS")
                 (:to-char 'col_date "YYYY-MM-DD")
        :from 'short-data-type-tests
        :where (:= 'id 1)))

(("2020-10-30 19:30:54 EDT" "2020-10-30 19:30:54 -04" "2020-10-30 19:30:54"
  "2020-10-30 19:30:54" "19:30:54" "2020-10-30"))
#+END_SRC
