doc/index.html
<div id="outline-container-e5c68251-0ca6-4f96-8d36-175cec626eeb" class="outline-3">
<h3 id="e5c68251-0ca6-4f96-8d36-175cec626eeb">Timezones and Simple-Date and Local-Time</h3>
<div class="outline-text-3" id="text-e5c68251-0ca6-4f96-8d36-175cec626eeb">
<p>
It is important to understand how postgresql (not postmodern) handles
timestamps and timestamps with time zones. Postgresql keeps everything
in UTC, it does not store a timezone even in a timezone aware column.
If you use a timestamp with timezone column, postgresql will calculate
the UTC time and will normalize the timestamp data to UTC. When you
later select the record, postgresql will look at the timezone for the
postgresql session, retrieve the data and then provide the data
recalculated from UTC to the timezone for that postgresql session.
There is a good writeup of timezones at
<a href="http://blog.untrod.com/2016/08/actually-understanding-timezones-in-postgresql.html">http://blog.untrod.com/2016/08/actually-understanding-timezones-in-postgresql.html</a>
and <a href="http://phili.pe/posts/timestamps-and-time-zones-in-postgresql/">http://phili.pe/posts/timestamps-and-time-zones-in-postgresql/</a>.
</p>

<p>
Without simple-date or local-time properly loaded and without use of the
Postgresql to_char function, sample date and time data from postgresql will
look like:
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">PG Type</th>
<th scope="col" class="org-right">Sample Return Value</th>
<th scope="col" class="org-left">Lisp Type</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">date</td>
<td class="org-right">3798576000</td>
<td class="org-left">(INTEGER 0 4611686018427387903)</td>
</tr>

<tr>
<td class="org-left">time_wo_tz</td>
<td class="org-right">((HOURS 9) (MINUTES 47) (SECONDS 9) (MICROSECONDS 926531))</td>
<td class="org-left">CONS</td>
</tr>

<tr>
<td class="org-left">time_w_tz</td>
<td class="org-right">09:47:16.510459-04</td>
<td class="org-left">(VECTOR CHARACTER 64)</td>
</tr>

<tr>
<td class="org-left">timestamp_wo_tz</td>
<td class="org-right">3798611253</td>
<td class="org-left">(INTEGER 0 4611686018427387903)</td>
</tr>

<tr>
<td class="org-left">timestamp_w_tz</td>
<td class="org-right">3798625647</td>
<td class="org-left">(INTEGER 0 4611686018427387903)</td>
</tr>
</tbody>
</table>

<p>
YOU DO NOT NEED TO ADD ANY OTHER LIBRARIES IF ALL YOU WANT TO DO IS GET ISO 8601 or
<a href="https://tools.ietf.org/html/rfc3339">RFC 3339</a> PROPERLY FORMATTED TIME AND DATE STRINGS WITH THE <a href="https://www.postgresql.org/docs/current/functions-formatting.html">TO_CHAR</a> POSTGRESQL
FUNCTION.
</p>

<p>
Assume a data table with columns  "col_timestamp_without_time_zone", "col_timestamp_with_time_zone", "col_timestamptz", "col_timestamp", "col_time"
and "col_date".
</p>

<p>
First, just basic sql. In this example we ask for the timestamp_with_time_zone field
three times to show differences in the result dealing with time zones. First we do not
add a timezone parameter to the pattern, the second time  we ask for the time zone
using TZ, the third time we ask for the offset from UTC and get back -04. We would get
the same result using those additional parameters with the col_timestamptz field.
</p>

<div class="org-src-container">
<pre class="src src-sql">(query "(<span style="color: #ffad29; font-weight: bold;">SELECT</span> to_char(col_timestamp_with_time_zone, E<span style="color: #e67128;">'YYYY-MM-DD HH24:MI:SS'</span>),
                to_char(col_timestamp_with_time_zone, E<span style="color: #e67128;">'YYYY-MM-DD HH24:MI:SS TZ'</span>),
                to_char(col_timestamp_with_time_zone, E<span style="color: #e67128;">'YYYY-MM-DD HH24:MI:SS OF'</span>),
                to_char(col_timestamptz, E<span style="color: #e67128;">'YYYY-MM-DD HH24:MI:SS'</span>),
                to_char(col_timestamp, E<span style="color: #e67128;">'YYYY-MM-DD HH24:MI:SS'</span>),
                to_char(col_time, E<span style="color: #e67128;">'HH24:MI:SS'</span>),
                to_char(col_date, E<span style="color: #e67128;">'YYYY-MM-DD'</span>)
         <span style="color: #ffad29; font-weight: bold;">FROM</span> short_data_type_tests
         <span style="color: #ffad29; font-weight: bold;">WHERE</span> (id = 1))")
(("2020-10-30 19:30:54" "2020-10-30 19:30:54 EDT" "2020-10-30 19:30:54 -04"
"2020-10-30 19:30:54" "2020-10-30 19:30:54" "19:30:54" "2020-10-30"))
</pre>
</div>

<p>
Now the s-sql version:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span>  (<span style="color: #23d7d7;">:to-char</span> 'col_timestamp_with_time_zone <span style="color: #e67128;">"YYYY-MM-DD HH24:MI:SS TZ"</span>)
                 (<span style="color: #23d7d7;">:to-char</span> 'col_timestamp_with_time_zone <span style="color: #e67128;">"YYYY-MM-DD HH24:MI:SS OF"</span>)
                 (<span style="color: #23d7d7;">:to-char</span> 'col_timestamptz <span style="color: #e67128;">"YYYY-MM-DD HH24:MI:SS"</span>)
                 (<span style="color: #23d7d7;">:to-char</span> 'col_timestamp <span style="color: #e67128;">"YYYY-MM-DD HH24:MI:SS"</span>)
                 (<span style="color: #23d7d7;">:to-char</span> 'col_time <span style="color: #e67128;">"HH24:MI:SS"</span>)
                 (<span style="color: #23d7d7;">:to-char</span> 'col_date <span style="color: #e67128;">"YYYY-MM-DD"</span>)
        <span style="color: #23d7d7;">:from</span> 'short-data-type-tests
        <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'id 1)))

((<span style="color: #e67128;">"2020-10-30 19:30:54 EDT"</span> <span style="color: #e67128;">"2020-10-30 19:30:54 -04"</span> <span style="color: #e67128;">"2020-10-30 19:30:54"</span>
  <span style="color: #e67128;">"2020-10-30 19:30:54"</span> <span style="color: #e67128;">"19:30:54"</span> <span style="color: #e67128;">"2020-10-30"</span>))
</pre>
</div>
</div>
