doc/index.org
*** Simple-Date Library Use
The Simple-date add-on library (not enabled by default)
provides types (CLOS classes) for dates, timestamps, and intervals
similar to the ones SQL databases use, in order to be able to store and read
these to and from a database in a straighforward way. A few obvious operations
are defined on these types.

To use simple-date with cl-postgres or postmodern,
load simple-date-cl-postgres-glue and register suitable SQL
readers and writers for the associated database types.

#+BEGIN_SRC lisp
(ql:quickload :simple-date/postgres-glue)

(setf cl-postgres:*sql-readtable*
        (cl-postgres:copy-sql-readtable
          simple-date-cl-postgres-glue:*simple-date-sql-readtable*))
#+END_SRC

With simple date loaded, the same data will look like this:

| PG Type                    | Sample Return Value                  | Lisp Type             |
|----------------------------+--------------------------------------+-----------------------|
| date                       | #<DATE 16-05-2020>                   | DATE                  |
| time_without_timezone      | #<TIME-OF-DAY 09:47:09.926531>       | TIME-OF-DAY           |
| time_with_timezone         | 09:47:16.510459-04                   | (VECTOR CHARACTER 64) |
| timestamp_without_timezone | #<TIMESTAMP 16-05-2020T09:47:33,315> | TIMESTAMP             |
| timestamp_with_timezone    | #<TIMESTAMP 16-05-2020T13:47:27,855> | TIMESTAMP             |

You can export these as json-strings with the encode-json-to-string function. E.g.
#+BEGIN_SRC lisp
(encode-json-to-string (query (:select 'timestamp-without-time-zone
                               :from 'test-data
                               :where (:= 'id 1))
                               :single))
"\"2020-12-30 13:30:54:0\""
#+END_SRC
Or more simply with passing one of the json result type parameters to the query
function. E.g.
#+BEGIN_SRC lisp
(query (:select 'timestamp-with-time-zone
        :from 'test-data
        :where (:< 'id 3))
  :json-strs)

'("{\"timestampWithTimeZone\":\"2019-12-30 18:30:54:0\"}"
  "{\"timestampWithTimeZone\":\"1919-12-30 18:30:54:0\"}")
#+END_SRC
To get back to the default cl-postgres reader:
#+BEGIN_SRC lisp
(setf cl-postgres:*sql-readtable*
        (cl-postgres:copy-sql-readtable
          cl-postgres::*default-sql-readtable*))
#+END_SRC
However [[http://marijnhaverbeke.nl/postmodern/simple-date.html][Simple-date]] has no concept of time zones. Many users use another library,
[[https://github.com/dlowe-net/local-time][local-time]], which solves the same problem as simple-date, but does understand
time zones. One thing to remember is that PostgreSQL doesn't store timezone
information when using `timestamp with time zone`. Time zone information only
used to convert it to proper UTC timestamp.

*** Local-Time Library Use
For those who want to use local-time, to enable the local-time reader:
#+BEGIN_SRC lisp
(ql:quickload :cl-postgres+local-time)
(local-time:set-local-time-cl-postgres-readers)
#+END_SRC

With that set postgresql time datatype returns look like:
With local-time loaded and local-time:set-local-time-cl-postgres-readers run,
the same sample data looks like:

| PG Type                    | Sample Return Value              | Lisp Type             |
|----------------------------+----------------------------------+-----------------------|
| date                       | 2020-05-15T20:00:00.000000-04:00 | TIMESTAMP             |
| time_without_timezone      | 2000-03-01T04:47:09.926531-05:00 | TIMESTAMP             |
| time_with_timezone         | 09:47:16.510459-04               | (VECTOR CHARACTER 64) |
| timestamp_without_timezone | 2020-05-16T05:47:33.315622-04:00 | TIMESTAMP             |
| timestamp_with_timezone    | 2020-05-16T09:47:27.855146-04:00 | TIMESTAMP             |

Similarly to simple-date timestamps, these can be exported as json-strings with the encode-json-to-string function. E.g.
#+BEGIN_SRC lisp
(encode-json-to-string (query (:select 'timestamp-with-time-zone
                               :from 'test-data
                               :where (:= 'id 1))
                               :single))
"\"{2020-12-30T08:30:54.000000-05:00}\""
#+END_SRC
Or more simply with passing one of the json result type parameters to the query
function. E.g.
#+BEGIN_SRC lisp
(query (:select 'timestamp-with-time-zone
        :from 'test-data
        :where (:< 'id 3))
  :json-strs)

'("{\"timestampWithTimeZone\":\"{2019-12-30T13:30:54.000000-05:00}\"}"
  "{\"timestampWithTimeZone\":\"{1919-12-30T13:30:54.000000-05:00}\"}")
#+END_SRC
** Portability
   :PROPERTIES:
   :ID:       769a0e88-de54-4356-a474-72708accbafb
   :CUSTOM_ID: bdf9ddb0-5f95-4807-8862-8970b35bd142
   :END:
The Lisp code in Postmodern is theoretically portable across implementations,
and seems to work on all major ones as well as some minor ones such as Genera.
It is regularly tested on ccl, sbcl, ecl, abcl and cmucl.

ABCL version 1.8.0 broke the dao class inheritance. See [[https://abcl.org/trac/ticket/479]].
Everything other than dao-classes works.

Clisp currently has issues with executing a file of sql statements (Postmodern's execute-file function).

Implementations that do not have meta-object protocol support will not have
DAOs, but all other parts of the library should work (all widely used
implementations do support this).

The library is not likely to work for PostgreSQL versions older than 8.4.
Other features only work in newer Postgresql versions as the features
were only introduced in those newer versions.

