doc/index.html
<div id="outline-container-orga2d6dea" class="outline-4">
<h4 id="orga2d6dea">Simple-Date Library Use</h4>
<div class="outline-text-4" id="text-orga2d6dea">
<p>
The Simple-date add-on library (not enabled by default)
provides types (CLOS classes) for dates, timestamps, and intervals
similar to the ones SQL databases use, in order to be able to store and read
these to and from a database in a straighforward way. A few obvious operations
are defined on these types.
</p>

<p>
To use simple-date with cl-postgres or postmodern,
load simple-date-cl-postgres-glue and register suitable SQL
readers and writers for the associated database types.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(ql:quickload <span style="color: #23d7d7;">:simple-date/postgres-glue</span>)

(setf cl-postgres:*sql-readtable*
        (cl-postgres:copy-sql-readtable
          simple-date-cl-postgres-glue:*simple-date-sql-readtable*))
</pre>
</div>

<p>
With simple date loaded, the same data will look like this:
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">PG Type</th>
<th scope="col" class="org-left">Sample Return Value</th>
<th scope="col" class="org-left">Lisp Type</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">date</td>
<td class="org-left">#&lt;DATE 16-05-2020&gt;</td>
<td class="org-left">DATE</td>
</tr>

<tr>
<td class="org-left">time_without_timezone</td>
<td class="org-left">#&lt;TIME-OF-DAY 09:47:09.926531&gt;</td>
<td class="org-left">TIME-OF-DAY</td>
</tr>

<tr>
<td class="org-left">time_with_timezone</td>
<td class="org-left">09:47:16.510459-04</td>
<td class="org-left">(VECTOR CHARACTER 64)</td>
</tr>

<tr>
<td class="org-left">timestamp_without_timezone</td>
<td class="org-left">#&lt;TIMESTAMP 16-05-2020T09:47:33,315&gt;</td>
<td class="org-left">TIMESTAMP</td>
</tr>

<tr>
<td class="org-left">timestamp_with_timezone</td>
<td class="org-left">#&lt;TIMESTAMP 16-05-2020T13:47:27,855&gt;</td>
<td class="org-left">TIMESTAMP</td>
</tr>
</tbody>
</table>

<p>
You can export these as json-strings with the encode-json-to-string function. E.g.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(encode-json-to-string (query (<span style="color: #23d7d7;">:select</span> 'timestamp-without-time-zone
                               <span style="color: #23d7d7;">:from</span> 'test-data
                               <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'id 1))
                               <span style="color: #23d7d7;">:single</span>))
<span style="color: #e67128;">"\"2020-12-30 13:30:54:0\""</span>
</pre>
</div>
<p>
Or more simply with passing one of the json result type parameters to the query
function. E.g.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> 'timestamp-with-time-zone
        <span style="color: #23d7d7;">:from</span> 'test-data
        <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:&lt;</span> 'id 3))
  <span style="color: #23d7d7;">:json-strs</span>)

'(<span style="color: #e67128;">"{\"timestampWithTimeZone\":\"2019-12-30 18:30:54:0\"}"</span>
  <span style="color: #e67128;">"{\"timestampWithTimeZone\":\"1919-12-30 18:30:54:0\"}"</span>)
</pre>
</div>
<p>
To get back to the default cl-postgres reader:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(setf cl-postgres:*sql-readtable*
        (cl-postgres:copy-sql-readtable
          cl-postgres::*default-sql-readtable*))
</pre>
</div>
<p>
However <a href="http://marijnhaverbeke.nl/postmodern/simple-date.html">Simple-date</a> has no concept of time zones. Many users use another library,
<a href="https://github.com/dlowe-net/local-time">local-time</a>, which solves the same problem as simple-date, but does understand
time zones. One thing to remember is that PostgreSQL doesn't store timezone
information when using `timestamp with time zone`. Time zone information only
used to convert it to proper UTC timestamp.
</p>
</div>
</div>

<div id="outline-container-org58574b4" class="outline-4">
<h4 id="org58574b4">Local-Time Library Use</h4>
<div class="outline-text-4" id="text-org58574b4">
<p>
For those who want to use local-time, to enable the local-time reader:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(ql:quickload <span style="color: #23d7d7;">:cl-postgres+local-time</span>)
(local-time:set-local-time-cl-postgres-readers)
</pre>
</div>

<p>
With that set postgresql time datatype returns look like:
With local-time loaded and local-time:set-local-time-cl-postgres-readers run,
the same sample data looks like:
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">PG Type</th>
<th scope="col" class="org-left">Sample Return Value</th>
<th scope="col" class="org-left">Lisp Type</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">date</td>
<td class="org-left">2020-05-15T20:00:00.000000-04:00</td>
<td class="org-left">TIMESTAMP</td>
</tr>

<tr>
<td class="org-left">time_without_timezone</td>
<td class="org-left">2000-03-01T04:47:09.926531-05:00</td>
<td class="org-left">TIMESTAMP</td>
</tr>

<tr>
<td class="org-left">time_with_timezone</td>
<td class="org-left">09:47:16.510459-04</td>
<td class="org-left">(VECTOR CHARACTER 64)</td>
</tr>

<tr>
<td class="org-left">timestamp_without_timezone</td>
<td class="org-left">2020-05-16T05:47:33.315622-04:00</td>
<td class="org-left">TIMESTAMP</td>
</tr>

<tr>
<td class="org-left">timestamp_with_timezone</td>
<td class="org-left">2020-05-16T09:47:27.855146-04:00</td>
<td class="org-left">TIMESTAMP</td>
</tr>
</tbody>
</table>

<p>
Similarly to simple-date timestamps, these can be exported as json-strings with the encode-json-to-string function. E.g.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(encode-json-to-string (query (<span style="color: #23d7d7;">:select</span> 'timestamp-with-time-zone
                               <span style="color: #23d7d7;">:from</span> 'test-data
                               <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'id 1))
                               <span style="color: #23d7d7;">:single</span>))
<span style="color: #e67128;">"\"{2020-12-30T08:30:54.000000-05:00}\""</span>
</pre>
</div>
<p>
Or more simply with passing one of the json result type parameters to the query
function. E.g.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> 'timestamp-with-time-zone
        <span style="color: #23d7d7;">:from</span> 'test-data
        <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:&lt;</span> 'id 3))
  <span style="color: #23d7d7;">:json-strs</span>)

'(<span style="color: #e67128;">"{\"timestampWithTimeZone\":\"{2019-12-30T13:30:54.000000-05:00}\"}"</span>
  <span style="color: #e67128;">"{\"timestampWithTimeZone\":\"{1919-12-30T13:30:54.000000-05:00}\"}"</span>)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-bdf9ddb0-5f95-4807-8862-8970b35bd142" class="outline-3">
<h3 id="bdf9ddb0-5f95-4807-8862-8970b35bd142">Portability</h3>
<div class="outline-text-3" id="text-bdf9ddb0-5f95-4807-8862-8970b35bd142">
<p>
The Lisp code in Postmodern is theoretically portable across implementations,
and seems to work on all major ones as well as some minor ones such as Genera.
It is regularly tested on ccl, sbcl, ecl, abcl and cmucl.
</p>

<p>
ABCL version 1.8.0 broke the dao class inheritance. See <a href="https://abcl.org/trac/ticket/479">https://abcl.org/trac/ticket/479</a>.
Everything other than dao-classes works.
</p>

<p>
Clisp currently has issues with executing a file of sql statements (Postmodern's execute-file function).
</p>

<p>
Implementations that do not have meta-object protocol support will not have
DAOs, but all other parts of the library should work (all widely used
implementations do support this).
</p>

<p>
The library is not likely to work for PostgreSQL versions older than 8.4.
Other features only work in newer Postgresql versions as the features
were only introduced in those newer versions.
</p>
</div>
</div>
