doc/index.org
** Reserved Words
   :PROPERTIES:
   :ID:       671c5e6a-f548-4791-86a5-575b3fcc0aa5
   :CUSTOM_ID: 565fad0b-aef4-497c-92d8-096a0a78c804
   :END:
It is highly suggested that you do not use words that are reserved by Postgresql
and the sql standard as identifiers (e.g. table names, columns). The reserved
words are:

"all" "analyse" "analyze" "and" "any" "array" "as" "asc" "asymmetric"
"authorization" "between" "binary" "both" "case" "cast" "check" "collate"
"column" "concurrently" "constraint" "create" "cross" "current-catalog"
"current-date" "current-role" "current-schema" "current-time"
"current-timestamp" "current-user" "default" "deferrable" "desc" "distinct" "do"
"else" "end" "except" "false" "fetch" "filter" "for" "foreign" "freeze" "from"
"full" "grant" "group" "having" "ilike" "in" "initially" "inner" "intersect"
"into" "is" "isnull" "join" "lateral" "leading" "left" "like" "limit"
"localtime" "localtimestamp" "natural" "new" "not" "notnull"  "nowait" "null"
"off" "offset" "old" "on" "only" "or" "order" "outer" "overlaps" "placing"
"primary" "references" "returning" "right" "select" "session-user" "share"
"similar" "some" "symmetric" "table" "then" "to" "trailing" "true" "union"
"unique" "user" "using" "variadic" "verbose" "when" "where" "window" "with"

** Things that should be implemented
   :PROPERTIES:
   :ID:       50d91126-93f1-4f50-96ad-bd63a7278866
   :CUSTOM_ID: 4ac8f5f4-d3b0-41c5-a222-fe3086049279
   :END:
Postmodern is under active development so Issues and feature requests should
be flagged on [[https://github.com/marijnh/Postmodern][Postmodern's site on github]].

Some areas that are currently under consideration can be found in the ROADMAP.md
file.

* Resources
  :PROPERTIES:
  :ID:       eb969965-5221-48f8-bb79-5a93fe451454
  :CUSTOM_ID: 773ee4ef-a685-484e-bc6a-6daa849a7d04
  :END:
- [[https://mailman.common-lisp.net/listinfo/postmodern-devel][Mailing List]]
- [[https://sites.google.com/site/sabraonthehill/postmodern-examples][A collection of Postmodern examples]]
- [[http://www.postgresql.org/docs/current/static/index.html][The PostgreSQL manuals]]
- [[http://www.postgresql.org/docs/current/static/protocol.html][The wire protocol Postmodern uses]]
- [[http://clsql.b9.com/][CLSQL]]
- [[https://github.com/filonenko-mikhail/cl-ewkb][Common Lisp Postgis library]]
- [[http://common-lisp.net/project/local-time/][Local-time]]

* Running tests
  :PROPERTIES:
  :ID:       bd354217-9828-444b-afbf-41e9f0d522ca
  :CUSTOM_ID: 844add79-070b-4e89-8797-3bc21ea3173b
  :END:

Postmodern uses [[https://github.com/sionescu/fiveam][FiveAM]] for
testing.  The different component systems of Postmodern have tests
defined in corresponding test systems, each defining a test suite.
The test systems and corresponding top-level test suites are:

- `:postmodern` in `postmodern/tests`,
- `:cl-postgres` in `cl-postgres/tests`,
- `:s-sql` in `s-sql/tests`, and
- `:simple-date` in `simple-date/tests`.

Before running the tests make sure PostgreSQL is running and a test
database is created.  By default tests use the following connection
parameters to run the tests:

- Database name: test
- User: test
- Password: <empty>
- Hostname: localhost
- Port: 5432
- Use-SSL :NO

If connection with these parameters fails then you will be asked to
provide the connection parameters interactively.  The parameters will
be stored in `cl-postgres-tests:*test-connection*` variable and
automatically used on successive test runs.  This variable can also be
set manually before running the tests.

To test a particular component one would first load the corresponding
test system, and then run the test suite.  For example, to test the
`postmodern` system in the REPL one would do the following:
#+BEGIN_SRC lisp
(ql:quickload "postmodern/tests")
(5am:run! :postmodern)

    ;; ... test output ...
#+END_SRC


It is also possible to test multiple components at once by first
loading test systems and then running all tests:
#+BEGIN_SRC lisp
(ql:quickload '("cl-postgres/tests" "s-sql/tests"))
(5am:run-all-tests)

    ;; ... test output ...
#+END_SRC

To run the tests from command-line specify the same forms using your
implementation's command-line syntax.  For instance, to test all
Postmodern components on SBCL, use the following command:

    env DB_USER=$USER sbcl --noinform \
        --eval '(ql:quickload "postmodern/tests")' \
        --eval '(ql:quickload "cl-postgres/tests")' \
        --eval '(ql:quickload "s-sql/tests")' \
        --eval '(ql:quickload "simple-date/tests")' \
        --eval '(progn (setq 5am:*print-names* nil) (5am:run-all-tests))' \
        --eval '(sb-ext:exit)'

As you can see from above, database connection parameters can be
provided using environment variables:

- `DB_NAME`: database name,
- `DB_USER`: user,
- `DB_PASS`: password,
- `DB_HOST`: hostname.
