doc/index.html

<div id="outline-container-565fad0b-aef4-497c-92d8-096a0a78c804" class="outline-3">
<h3 id="565fad0b-aef4-497c-92d8-096a0a78c804">Reserved Words</h3>
<div class="outline-text-3" id="text-565fad0b-aef4-497c-92d8-096a0a78c804">
<p>
It is highly suggested that you do not use words that are reserved by Postgresql
and the sql standard as identifiers (e.g. table names, columns). The reserved
words are:
</p>

<p>
"all" "analyse" "analyze" "and" "any" "array" "as" "asc" "asymmetric"
"authorization" "between" "binary" "both" "case" "cast" "check" "collate"
"column" "concurrently" "constraint" "create" "cross" "current-catalog"
"current-date" "current-role" "current-schema" "current-time"
"current-timestamp" "current-user" "default" "deferrable" "desc" "distinct" "do"
"else" "end" "except" "false" "fetch" "filter" "for" "foreign" "freeze" "from"
"full" "grant" "group" "having" "ilike" "in" "initially" "inner" "intersect"
"into" "is" "isnull" "join" "lateral" "leading" "left" "like" "limit"
"localtime" "localtimestamp" "natural" "new" "not" "notnull"  "nowait" "null"
"off" "offset" "old" "on" "only" "or" "order" "outer" "overlaps" "placing"
"primary" "references" "returning" "right" "select" "session-user" "share"
"similar" "some" "symmetric" "table" "then" "to" "trailing" "true" "union"
"unique" "user" "using" "variadic" "verbose" "when" "where" "window" "with"
</p>
</div>
</div>

<div id="outline-container-4ac8f5f4-d3b0-41c5-a222-fe3086049279" class="outline-3">
<h3 id="4ac8f5f4-d3b0-41c5-a222-fe3086049279">Things that should be implemented</h3>
<div class="outline-text-3" id="text-4ac8f5f4-d3b0-41c5-a222-fe3086049279">
<p>
Postmodern is under active development so Issues and feature requests should
be flagged on <a href="https://github.com/marijnh/Postmodern">Postmodern's site on github</a>.
</p>

<p>
Some areas that are currently under consideration can be found in the ROADMAP.md
file.
</p>
</div>
</div>
</div>

<div id="outline-container-773ee4ef-a685-484e-bc6a-6daa849a7d04" class="outline-2">
<h2 id="773ee4ef-a685-484e-bc6a-6daa849a7d04">Resources</h2>
<div class="outline-text-2" id="text-773ee4ef-a685-484e-bc6a-6daa849a7d04">
<ul class="org-ul">
<li><a href="https://mailman.common-lisp.net/listinfo/postmodern-devel">Mailing List</a></li>
<li><a href="https://sites.google.com/site/sabraonthehill/postmodern-examples">A collection of Postmodern examples</a></li>
<li><a href="http://www.postgresql.org/docs/current/static/index.html">The PostgreSQL manuals</a></li>
<li><a href="http://www.postgresql.org/docs/current/static/protocol.html">The wire protocol Postmodern uses</a></li>
<li><a href="http://clsql.b9.com/">CLSQL</a></li>
<li><a href="https://github.com/filonenko-mikhail/cl-ewkb">Common Lisp Postgis library</a></li>
<li><a href="http://common-lisp.net/project/local-time/">Local-time</a></li>
</ul>
</div>
</div>

<div id="outline-container-844add79-070b-4e89-8797-3bc21ea3173b" class="outline-2">
<h2 id="844add79-070b-4e89-8797-3bc21ea3173b">Running tests</h2>
<div class="outline-text-2" id="text-844add79-070b-4e89-8797-3bc21ea3173b">
<p>
Postmodern uses <a href="https://github.com/sionescu/fiveam">FiveAM</a> for
testing.  The different component systems of Postmodern have tests
defined in corresponding test systems, each defining a test suite.
The test systems and corresponding top-level test suites are:
</p>

<ul class="org-ul">
<li>`:postmodern` in `postmodern/tests`,</li>
<li>`:cl-postgres` in `cl-postgres/tests`,</li>
<li>`:s-sql` in `s-sql/tests`, and</li>
<li>`:simple-date` in `simple-date/tests`.</li>
</ul>

<p>
Before running the tests make sure PostgreSQL is running and a test
database is created.  By default tests use the following connection
parameters to run the tests:
</p>

<ul class="org-ul">
<li>Database name: test</li>
<li>User: test</li>
<li>Password: &lt;empty&gt;</li>
<li>Hostname: localhost</li>
<li>Port: 5432</li>
<li>Use-SSL :NO</li>
</ul>

<p>
If connection with these parameters fails then you will be asked to
provide the connection parameters interactively.  The parameters will
be stored in `cl-postgres-tests:*test-connection*` variable and
automatically used on successive test runs.  This variable can also be
set manually before running the tests.
</p>

<p>
To test a particular component one would first load the corresponding
test system, and then run the test suite.  For example, to test the
`postmodern` system in the REPL one would do the following:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(ql:quickload <span style="color: #e67128;">"postmodern/tests"</span>)
(5am:run! <span style="color: #23d7d7;">:postmodern</span>)

    <span style="color: #74af68;">;; </span><span style="color: #74af68;">... test output ...</span>
</pre>
</div>


<p>
It is also possible to test multiple components at once by first
loading test systems and then running all tests:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(ql:quickload '(<span style="color: #e67128;">"cl-postgres/tests"</span> <span style="color: #e67128;">"s-sql/tests"</span>))
(5am:run-all-tests)

    <span style="color: #74af68;">;; </span><span style="color: #74af68;">... test output ...</span>
</pre>
</div>

<p>
To run the tests from command-line specify the same forms using your
implementation's command-line syntax.  For instance, to test all
Postmodern components on SBCL, use the following command:
</p>

<p>
env DB_USER=$USER sbcl &#x2013;noinform \
    &#x2013;eval '(ql:quickload "postmodern/tests")' \
    &#x2013;eval '(ql:quickload "cl-postgres/tests")' \
    &#x2013;eval '(ql:quickload "s-sql/tests")' \
    &#x2013;eval '(ql:quickload "simple-date/tests")' \
    &#x2013;eval '(progn (setq 5am:*print-names* nil) (5am:run-all-tests))' \
    &#x2013;eval '(sb-ext:exit)'
</p>

<p>
As you can see from above, database connection parameters can be
provided using environment variables:
</p>

<ul class="org-ul">
<li>`DB_NAME`: database name,</li>
<li>`DB_USER`: user,</li>
<li>`DB_PASS`: password,</li>
<li>`DB_HOST`: hostname.</li>
</ul>
</div>
</div>
</div>
</body>
</html>
